{
"intents": [
      {
            "tag": 0,
            "patterns": [
                  "I forgot my gmail password"
            ],
            "responses": [
                  "Starting the "
            ]
      },
      {
            "tag": 1,
            "patterns": [
                  "I forgot my gmail password",
                  "How do I recover my gmail password?"
            ],
            "responses": [
                  "Starting the password recovery process is pretty easy: just click the “forgot password” link on the Gmail sign-in page. You’ll then be shown a asking you to put in the last password you can remember. If you can remember a correct password and you have a backup system set up, you’ll then be asked to continue in a variety of ways. If you can’t remember any of them, click “try a different question.” The next option will be sending a code to a recovery email, which rather presumes that you have a secondary recovery email (which you set up way back when you created your Gmail account in the first place). Using this option will send you a link at your secondary email account (which doesn’t need to be Gmail), with a 6-digit code that will allow you to set up a new password and regain access to your account. Check your mail on this secondary account to see the code, then enter it to unlock a new password generator. Newer accounts may also have a phone number backup option—see below. If that doesn’t work—like, say, you don’t have access to the account that you originally designated as a backup either—click “try a different question” again. Now we’re getting into older, less secure methods of account protection, like security questions such as “what’s your mother’s maiden name.” You should be able to answer at least one of these."
            ]
      },
      {
            "tag": 2,
            "patterns": [
                  "Can i prevent people from guessing my password",
                  "What is an account lockout?"
            ],
            "responses": [
                  "Account lockout keeps the account secure and prevents anyone/anything from guessing the password multiple times. When your account is locked you must wait the set amount of time before being able to log back in. "
            ]
      },
      {
            "tag": 3,
            "patterns": [
                  "I dont know about passwords",
                  "What is a password?"
            ],
            "responses": [
                  "A password is a set of secret characters or words used to authenticate access to and secure a digital system. They help to ensure that computers or data can only be accessed by those who have the right to view/access the data. "
            ]
      },
      {
            "tag": 4,
            "patterns": [
                  "Will I be logged in on all devices after password reset? ",
                  "What happens when you reset your password?"
            ],
            "responses": [
                  "After resetting password, you'll be logged out of everywhere except: the device you used to verify that its you when you sign in."
            ]
      },
      {
            "tag": 5,
            "patterns": [
                  "Can someone else reset the password for my account? ",
                  "What is facilitated password reset? "
            ],
            "responses": [
                  "A facilitated reset allows a delegate (such as an administrator or service desk operator) to perform a password reset or account unlock on behalf of another user. That said, there are often security holes in the facilitated reset process"
            ]
      },
      {
            "tag": 6,
            "patterns": [
                  "Why cant i make a short password",
                  "Why is there a minimum password length?"
            ],
            "responses": [
                  "Minimum recommended length for passwords is 8 characters, to increase complexity of password and prevent the account from hacking since its difficult to break."
            ]
      },
      {
            "tag": 7,
            "patterns": [
                  "Why is important to use special characters, alphabets and numbers in a password ",
                  "Whats the role of a password being complex with mixture of different characters? "
            ],
            "responses": [
                  "Security experts agree that upper and lowercase alphanumerical characters & special characters are good practices for increasing passwords strength and making it capable of resisting guessing and brute-force attacks. In order to add complexity without compromising ease-of-use, users could modify passphrases by inserting spaces, punctuation and misspellings"
            ]
      },
      {
            "tag": 8,
            "patterns": [
                  "not receiving two factor verification code",
                  "What to do if I am not receiving verfication code? "
            ],
            "responses": [
                  "Try the following: Check if the date and time on your device is up to date. Check if you have an updated app. Make sure your network connection is strong."
            ]
      },
      {
            "tag": 9,
            "patterns": [
                  "I dont want two factor authentication",
                  "How can I disable two factor authentication?"
            ],
            "responses": [
                  "Each sysem has different process. But the general idea is to go to settings>>Passwords and Security tab>>Two factor authentication and turn it off. "
            ]
      },
      {
            "tag": 10,
            "patterns": [
                  "I forgot/lost my phone, how do i get through with 2FA?",
                  "What if I lost the device I used to set up two-factor authentication?"
            ],
            "responses": [
                  "a. Disable two-factor authentication using a back-up code. b. Receive more back-up codes for two-factor authentication on your back-up phone number. If a and b dont work, contact help desk for a particular website. "
            ]
      },
      {
            "tag": 11,
            "patterns": [
                  "Is it safe to repeat same password everywhere?",
                  "Is using same password for multiple accounts/websites safe?"
            ],
            "responses": [
                  "If its a matter of safety, using the same passwords everywhere will make your accounts more vulnerable to hacking. However, if you have accounts which pose no security risk if compromised, using same password on all of them is a no-brainer. Update this password across all applicable locations when it changes to ensure consistency."
            ]
      },
      {
            "tag": 12,
            "patterns": [
                  "I dont know when my password expires",
                  "How to keep a track that the password will change soon or expire? "
            ],
            "responses": [
                  "The key is to be proactive. Its recommended to set reminders to change their passwords before they actually expire. Also, keep track of when your password will expire even if you do get advanced notification (such as emails)."
            ]
      },
      {
            "tag": 13,
            "patterns": [
                  "Why to use password managers ",
                  "What are the advantages of using a password manager?"
            ],
            "responses": [
                  "a. Passwords are kept in one safe place. b.No need to remember all passwords. c.It allows generating robust passwords d.It makes it easier to change passwords"
            ]
      },
      {
            "tag": 14,
            "patterns": [
                  "Why not to use password managers",
                  "What are the disadvantages of using a password manager?"
            ],
            "responses": [
                  "a. Forgetting master password could be disastrous b. Forgetting to sing out could allow someone access to all accounts. c.It may not protect your data from specific threats. d. The tool can be rather expensive"
            ]
      },
      {
            "tag": 15,
            "patterns": [
                  "Are there other forms of passwords ",
                  "What is a picture password?"
            ],
            "responses": [
                  "Picture password is a feature introduced with Windows 8 that allows you to create three different gestures on any image of your choice and then use those gestures as your password. The gesture can be any combination of circles, straight lines, and taps. For example, if the picture was a face, you could be a tap on each eye and then circle around the mouth."
            ]
      },
      {
            "tag": 16,
            "patterns": [
                  "I want to unlock my laptop with a picture",
                  "How to enable picture password?"
            ],
            "responses": [
                  "1. Open Windows Charms. 2. Click Settings and then More PC Settings. 3. There, click Users and Create Picture Password."
            ]
      },
      {
            "tag": 17,
            "patterns": [
                  "why to use automated password reset",
                  "What are the advantages for automated password reset?"
            ],
            "responses": [
                  "It will help combat the following: It’s time-consuming for both users and help desk staff. During non-business hours, help desk services may not be available – keeping users from their apps, data and other tools. Costs add up quickly due to the large number of tickets. Technicians may become bored or frustrated with spending so much of their time on elementary tasks – leading to high staff turnover.\n"
            ]
      },
      {
            "tag": 18,
            "patterns": [
                  "I don't know how to make a high-securitty password.",
                  "What are the tips to create a high-security password"
            ],
            "responses": [
                  "Make it long. This is the most critical factor. Choose nothing shorter than 15 characters, more if possible.\nUse a mix of characters. The more you mix up letters (upper-case and lower-case), numbers, and symbols, the more potent your password is, and the harder it is for a brute force attack to crack it.\nAvoid common substitutions. Password crackers are hip to the usual substitutions. Whether you use DOORBELL or D00R8377, the brute force attacker will crack it with equal ease. These days, random character placement is much more effective than common leetspeak* substitutions. (*leetspeak definition: an informal language or code used on the Internet, in which standard letters are often replaced by numerals or special characters.)\nDon’t use memorable keyboard paths. Much like the advice above not to use sequential letters and numbers, do not use sequential keyboard paths either (like qwerty). These are among the first to be guessed."
            ]
      },
      {
            "tag": 19,
            "patterns": [
                  "I need a hint.",
                  "What is my password hint?"
            ],
            "responses": [
                  "*give them the hint that they entered*"
            ]
      },
      {
            "tag": 20,
            "patterns": [
                  "I want to see all of the security questions",
                  "What are some security questions"
            ],
            "responses": [
                  "*give them the security questions in the system*"
            ]
      },
      {
            "tag": 21,
            "patterns": [
                  "I don't know what is a security question",
                  "What is a security question"
            ],
            "responses": [
                  "Password security question are meant to add an additional layer of security to online account logins."
            ]
      },
      {
            "tag": 22,
            "patterns": [
                  "Simple password vs. Strong password",
                  "Why do I need to make a strong and uncommon password?"
            ],
            "responses": [
                  "The weaker a password is, the easier it is to hack. Cybercriminals have a list of the most common passwords (12345, qwerty, password123, etc.), and too often that’s all they need to break into a corporate network.\nPasswords that are too short (less than about 7 characters) and use all lowercase letters, make it easy for a hacker to breach either by guessing or using a software designed to crack a login.\nComplicated passwords that are long, use a combination of symbols, numbers, and upper and lowercase letters are much more difficult for a hacker to get past."
            ]
      },
      {
            "tag": 23,
            "patterns": [
                  "I will include my personal information in my password so I can remember it",
                  "Should I include my personal information in my password?"
            ],
            "responses": [
                  "While it is not recommended, Internet users tend to include personal information in their passwords for easy memorization. However, the use of personal information in passwords and its security implications have yet to be studied."
            ]
      },
      {
            "tag": 24,
            "patterns": [
                  "I have my Capslock on",
                  "Does case-sensitive matter in password?"
            ],
            "responses": [
                  "Yes, case-sensitive matter in your password."
            ]
      },
      {
            "tag": 25,
            "patterns": [
                  "I don't know who can steal my password.",
                  "Who can steal my password?"
            ],
            "responses": [
                  "Hackers, criminals who want your personal information"
            ]
      },
      {
            "tag": 26,
            "patterns": [
                  "I want to know if my password is safe or not",
                  "How do I know if my password safe or not?"
            ],
            "responses": [
                  "A password should include a combination of letters, numbers, and characters. A password shouldn't be shared with any other account. A password shouldn't include any of the user's personal information like their address or phone number."
            ]
      },
      {
            "tag": 27,
            "patterns": [
                  "I want to use previous passwords",
                  "Can I use previous passwords?"
            ],
            "responses": [
                  "No, we don't recommend you to use your previous passwords because this act will increase your chance of losing your account to hackers."
            ]
      },
      {
            "tag": 28,
            "patterns": [
                  "I don't understand why my new password needs to be unique.",
                  "Why must new password different from the old password?"
            ],
            "responses": [
                  "If you try to use the same password, you aren't changing your password. You're re-entering your password. We want you to change your password to limit the amount of time a compromised password is valid."
            ]
      },
      {
            "tag": 29,
            "patterns": [
                  "I want to use the same password that I used on other websites.",
                  "Should I use the same password for multiple websites?"
            ],
            "responses": [
                  "Reusing the same password is a bad practice because it opens up to credential stuffing attacks, which take leaked credentials from one site/service and use them on other sites/services. It's as if you had multiple houses and used the same lock and key for all of them"
            ]
      },
      {
            "tag": 30,
            "patterns": [
                  "I want to remember my password.",
                  "What should I do to remember your password?"
            ],
            "responses": [
                  "Write it down on paper, notebook, or sticky notes but do not include your username and the website address. Typing your password at least 30 times to help you commit your password to the muscle memory. "
            ]
      },
      {
            "tag": 31,
            "patterns": [
                  "My password is too old",
                  "How often should I change my password?"
            ],
            "responses": [
                  "At least once every 60-90 days, if not more. "
            ]
      },
      {
            "tag": 32,
            "patterns": [
                  "I want to use two factor authentication",
                  "How does two factor authentication makeyour account more secure"
            ],
            "responses": [
                  "The idea is that you're adding a confirmatory step to your sign in attempt. Using the SMS example, it means no one can log into the account in question from a new device, even if they have your password. When someone tries to log into your account from a new device, or even new browser, with your password, when they hit \"enter\" or \"submit\", it'll take them to a new screen asking for a code. This code has been sent to the registered mobile number as an SMS. "
            ]
      },
      {
            "tag": 33,
            "patterns": [
                  "I want to set up two factor authentication",
                  "How do I set up two factor authentication?"
            ],
            "responses": [
                  "Each website has their own two factor authentication. In order to set them up, you have to go to their security setting and choose two-step verification or two-factor authentication"
            ]
      },
      {
            "tag": 34,
            "patterns": [
                  "I don't know two factor authentication",
                  "What is two factor authentication?"
            ],
            "responses": [
                  "It's basically adding a second layer of protection to your account, app or service to go alongside your regular method of logging in. In most instances, this involves receiving a code by SMS to your mobile number, but increasingly apps and services are sending a confirmation number to your device as a notification instead. Sometimes you can just tap the notification to approve the login. "
            ]
      },
      {
            "tag": 35,
            "patterns": [
                  "I want to use password managers.",
                  "Should I use password managers?"
            ],
            "responses": [
                  "Yes. Password managers are a good thing. They give you huge advantages in a world where there's far too many passwords for anyone to remember. they make it easy for you to use long, complex, unique passwords across different sites and services, with no memory burden. They are better than humans at spotting fake websites, so they can help prevent you falling for phishing attacks"
            ]
      },
      {
            "tag": 36,
            "patterns": [
                  "Password managers bad sides",
                  "What are the cons of password managers?"
            ],
            "responses": [
                  "Your password could get stolen in one go. If you forget the master password for your password manager, you will not be able to get back in. You will have to try and access all your accounts individually, or recreate/reset them from scratch. This will hurt."
            ]
      },
      {
            "tag": 37,
            "patterns": [
                  "My password is safe. I don't want to change it.",
                  "Why your password may not always safe?"
            ],
            "responses": [
                  "Massive breaches happen all of the time. Because they already have your password and because passwords are hard to think up and get reused (62% of users admit reuse), hackers can break into more than one of your accounts. More than 20 million accounts probed daily in Microsoft ID systems."
            ]
      },
      {
            "tag": 38,
            "patterns": [
                  "I want to use simple password",
                  "Why I should not use weak passwords?"
            ],
            "responses": [
                  "By that logic you could just say \"Why should I lock my door when I leave my house? Someone could just throw a brick through the window if they wanted in anyways\". Weak passwords always play a major role in any hack. Weak passwords can be guessable or attacker can bruteforce if the length of the password is very small. Your privacy should always remain a top priority when using the internet and you should protect that privacy any way you know how. "
            ]
      },
      {
            "tag": 39,
            "patterns": [
                  "I want to use password generators",
                  "Should I use password generators?"
            ],
            "responses": [
                  "Password generators can save you from fraud and other cyber security threats by creating secure and strong passwords. However, all passwords are not created equally. Understand how each password works to get the one that will befit your requirements."
            ]
      },
      {
            "tag": 40,
            "patterns": [
                  "Hackers cannot steal my password.",
                  "How can hackers get my password?"
            ],
            "responses": [
                  "When hackers are trying to get passwords, they don’t guess them one by one in a password field. Instead, they have a toolbox of software programs and databases to help them figure out credentials that might work. most passwords that hackers have access to are stolen in large data breaches from popular online services. When popular services like LinkedIn, eBay, and Adobe have millions of records leaked, the passwords stolen in those breaches are compiled in large databases. Less well-known websites are also regularly hacked due to poor security protocols. So, what do hackers do? They use these “dumps” of data to perform “credential stuffing”, where they use software (or “bots”) to automatically test every username and password combination in the database to see if any successfully log on to another website (like a bank). "
            ]
      },
      {
            "tag": 41,
            "patterns": [
                  "I don't know why hackers steal my password",
                  "What happen if hackers stole my password and information?"
            ],
            "responses": [
                  "Criminals use stolen login credentials to break into accounts with payment details, such as shopping accounts. This is called account takeover, and it often leads to identity theft. If the hacker changes your password, you will also lose access to your account."
            ]
      },
      {
            "tag": 42,
            "patterns": [
                  "I don't need special characters in my password.",
                  "Why should I include some special characters such as @,#,!, etc.?"
            ],
            "responses": [
                  "Special characters will make your password more secure because it will make your password become more unique and it will become a challenge for hackers to know your password and steal your personal information."
            ]
      },
      {
            "tag": 43,
            "patterns": [
                  "What are the password requirements",
                  "What should my password consist of"
            ],
            "responses": [
                  "Characteristics of strong passwords: At least 8 characters—the more characters, the better, A mixture of both uppercase and lowercase letters, A mixture of letters and numbers, Inclusion of at least one special character, e.g., ! @ # ? ],Note: do not use < or > in your password, as both can cause problems in Web browsers."
            ]
      },
      {
            "tag": 44,
            "patterns": [
                  "What shouldn't I include in a password",
                  "what isn't allowed in my password"
            ],
            "responses": [
                  "Don’t use easily guessed passwords, such as “password” or “user.” 1. Do not choose passwords based upon details that may not be as confidential as you’d expect, such as your birth date, your Social Security or phone number, or names of family members. 2. Do not use words that can be found in the dictionary. Password-cracking tools freely available online often come with dictionary lists that will try thousands of common names and passwords. If you must use dictionary words, try adding a numeral to them, as well as punctuation at the beginning or end of the word (or both!). 3. Avoid using simple adjacent keyboard combinations: For example, “qwerty” and “asdzxc” and “123456” are horrible passwords and that are trivial to crack."
            ]
      },
      {
            "tag": 45,
            "patterns": [
                  "which passwords are the most common",
                  "what are common passwords"
            ],
            "responses": [
                  "These are the 10 most frequently used and worst passwords of 2020, according to NordPass's most common passwords list:\n\n123456\n123456789\npicture1\npassword\n12345678\n111111\n123123\n12345\n1234567890\nsenha"
            ]
      },
      {
            "tag": 46,
            "patterns": [
                  "can my password be the same as my username",
                  "am i allowed to use my username as a password"
            ],
            "responses": [
                  "No!"
            ]
      },
      {
            "tag": 47,
            "patterns": [
                  "how long can my password be",
                  "is there a required length for my password"
            ],
            "responses": [
                  "A password should be 12 characters at a minimum — ideally 16 or more. Using a multi-word passphrase makes even longer passwords possible and easy to remember."
            ]
      },
      {
            "tag": 48,
            "patterns": [
                  "how often should i change my password ",
                  "should i change my password"
            ],
            "responses": [
                  "At least once every 60-90 days, if not more. Be sure you're using tools like multi-factor authentication and a password manager to beef up your password security. Creating a secure password is the first step in taking control of your password security"
            ]
      },
      {
            "tag": 49,
            "patterns": [
                  "why do i need a password",
                  "why are passwords needed "
            ],
            "responses": [
                  "Passwords provide the first line of defense against unauthorized access to your computer and personal information. The stronger your password, the more protected your computer will be from hackers and malicious software. You should maintain strong passwords for all accounts on your computer."
            ]
      },
      {
            "tag": 50,
            "patterns": [
                  "what are the best types of passwords ",
                  "what type of password would you recommend"
            ],
            "responses": [
                  "A strong password is one you can’t guess or crack using a brute force attack. Hackers use computers to try various combinations of letters, numbers, and symbols in search of the right password. Modern computers can crack short passwords consisting of only letters and numbers in mere moments."
            ]
      },
      {
            "tag": 51,
            "patterns": [
                  "how can i remeber my password",
                  "What can I do to help me remember my new password?"
            ],
            "responses": [
                  "There are a number of things you can do: Write it down.It should be the only thing on the paper, do not include your username. When writing down a password you should obfuscate it in some fashion, such as adding characters to it or taking characters out so that someone who sees it will have a hard time guessing your password. Once you’ve written it down you should store it in a safe place like a locked drawer. After you have memorized your password you should destroy the paper so that the password only exists in your head. Type it thirty (30) times in a row.Typing your password thirty times will help you commit it to muscle memory.Chose not to have applications save your password.By choosing not to have applications save your password you will force yourself to type your password more often. This will improve your ability to remember your password."
            ]
      },
      {
            "tag": 52,
            "patterns": [
                  "what are the different types of user autentication methods ",
                  "what types of passwords are there"
            ],
            "responses": [
                  "Single-Factor/Primary Authentication.\nTwo-Factor Authentication (2FA)\nSingle Sign-On (SSO) \nMulti-Factor Authentication (MFA) \nPassword Authentication Protocol (PAP) \nChallenge Handshake Authentication Protocol (CHAP) \nExtensible Authentication Protocol (EAP)"
            ]
      },
      {
            "tag": 53,
            "patterns": [
                  "why do i need to reset my password"
            ],
            "responses": [
                  "you should change your password because hacker can hack that"
            ]
      },
      {
            "tag": 54,
            "patterns": [
                  "what are common security questions"
            ],
            "responses": [
                  "What is your mother's maiden name?\nWhat is the name of your first pet?\nWhat was your first car?\nWhat elementary school did you attend?\nWhat is the name of the town where you were born?"
            ]
      },
      {
            "tag": 55,
            "patterns": [
                  "can i use the same password for everything"
            ],
            "responses": [
                  "No its not safe to. Using different passwords on different sites is not only good practice, it's necessary to keep your accounts safe. In addition to the risks of exposing your password to malware on your own machine, using the same password everywhere puts you at the mercy of the service with the worst security. Hackers take passwords, email addresses, and user names they discover and try to sign in with them at other online services, which works surprisingly often. Different passwords for everything prevents it."
            ]
      },
      {
            "tag": 56,
            "patterns": [
                  "why does my password have to be so complicated ",
                  "why does my password have to be unique"
            ],
            "responses": [
                  "The weaker a password is, the easier it is to hack. Cybercriminals have a list of the most common passwords (12345, qwerty, password123, etc.), and too often that’s all they need to break into a corporate network. Passwords that are too short (less than about 7 characters) and use all lowercase letters, make it easy for a hacker to breach either by guessing or using a software designed to crack a login. Complicated passwords that are long, use a combination of symbols, numbers, and upper and lowercase letters are much more difficult for a hacker to get past."
            ]
      },
      {
            "tag": 57,
            "patterns": [
                  "should i share my password with people i trust ",
                  "is it safe to share my password"
            ],
            "responses": [
                  "Anytime you share your password with someone else, you lose control over its security. Even if it’s a trusted friend, they could accidentally leave your password written down on a sticky note on the desk or share it with someone else. Whatever happens on your login is your responsibility, even if it wasn’t you that logged in, so it’s best to never share your password. "
            ]
      },
      {
            "tag": 58,
            "patterns": [
                  "how am i supposed to remember a bunch of unique, difficult passwords?"
            ],
            "responses": [
                  "If someone had even 20 different logins (most people use many more than that between home and work) and each of those used what’s considered a strong password and each one used a completely different password, it would be impossible for the average person to remember them all. And especially so if they changed regularly. The answer is to use a password management application. Not only does it reduce the passwords you have to remember to one, it also can suggest strong passwords when setting up logins and will keep your passwords stored securely in a password vault."
            ]
      },
      {
            "tag": 59,
            "patterns": [
                  "what should i do if someone find out my password ",
                  "what to do if someone guesses my password"
            ],
            "responses": [
                  "The first thing to do when your password is stolen is to change it immediately. And additionally, while it's a huge pain, you should have different passwords for each account so when something like this happens you don't have to change them all."
            ]
      },
      {
            "tag": 60,
            "patterns": [
                  "what type of password system is the most secure",
                  "what type of user authentication method is the most secure"
            ],
            "responses": [
                  "To be classed as \"strong\" authentication requires two factors out of:\n\nSomething you have I.e token, smart card, mobile phone ...\nSomething you know I.e password, secret ...\nSomething you are I.e finger print, iris scan ...\nOne of these factors must be the something you have I.e a physical device that only you have access to.\n\nThe most secure type of authentication is down to the details of the physical device factor. The strongest approaches use PKI cryptography where the private key is stored on a smart card and never leaves the smart card, and where it is extremely difficult, given the smart card to be able to clone it quickly.\n\nYou don't necessarily need this Rolls Royce physical factor approach though. All forms of physical factor are pretty good. Sending a one-time-password to a phone via SMS is great for most applications and at a totally different level in terms of security compared to logonid and password.\n\nThe most secure approach for authentication however will come when we the users are allowed to choose the authentication provider we want to use for every site we visit. Of course there will be minimum requirements. On a bank site our authentication provider will have to support \"strong\" authentication and also in future digital signing of transactions. This brave new world is referred to as federated authentication. The U.S. Government led NSTIC is trying to stimulate federated authentication and the wider topic of federated identity adoption."
            ]
      },
      {
            "tag": 61,
            "patterns": [
                  "why are security questions needed"
            ],
            "responses": [
                  "Security questions can add an extra layer of certainty to your authentication process. Security questions are an alternative way of identifying your consumers when they have forgotten their password, entered the wrong credentials too many times, or tried to log in from an unfamiliar device or location."
            ]
      },
      {
            "tag": 62,
            "patterns": [
                  "is it common to share your password",
                  "do people share their passwords "
            ],
            "responses": [
                  "You should never share your password. When you share your password with another person, you essentially grant them access to not only that account, but every account you own that uses the same password."
            ]
      },
      {
            "tag": 63,
            "patterns": [
                  "I forgot my Skype password"
            ],
            "responses": [
                  "If you forgot your Skype password, reset your password now. \nIf you forgot your Skype password but do not have access to your email or phone to verify your identity:\nGo to the account recovery form.\nYou will be asked for your email, phone number and Skype name as well as an additional email that we can contact you at.\nFind information about the recovery form, including tips for completing it, here. \nOnce you have submitted the form it may take up to 24 hours to verify your information.  The results of the request will be sent to the additional email address you provided."
            ]
      },
      {
            "tag": 64,
            "patterns": [
                  "How do I change or reset my password for Skype?"
            ],
            "responses": [
                  "Sign into your account.\nSelect the change password link.\nWe'll take you through the process of changing your password."
            ]
      },
      {
            "tag": 65,
            "patterns": [
                  "I need to create a password",
                  "How do I create a strong password ?"
            ],
            "responses": [
                  "The key aspects of a strong password are length (the longer the better); a mix of letters (upper and lower case), numbers, and symbols, no ties to your personal information, and no dictionary words."
            ]
      },
      {
            "tag": 66,
            "patterns": [
                  "Change passwords",
                  "Do I really need to change my password often?"
            ],
            "responses": [
                  "At least once every 60-90 days, if not more. Be sure you’re using tools like multi-factor authentication and a password manager to beef up your password security"
            ]
      },
      {
            "tag": 67,
            "patterns": [
                  "password manager",
                  "What are the most popular password managers ?"
            ],
            "responses": [
                  "The four most popular Password managers are LastPass, KeePassX, dashlane, 1Password"
            ]
      },
      {
            "tag": 68,
            "patterns": [
                  "Security questions",
                  "What security question should I pick ?"
            ],
            "responses": [
                  "Any security questions presented to users to reset forgotten passwords must meet the following characteristics:\n 1) Memorable: The user must be able to recall the answer to the question, potentially years after creating their account.\n 2) Consistent: The answer to the question must not change over time.\n 3) Applicable: The user must be able to answer the question.\n 4) Confidential: The answer to the question must be hard for an attacker to obtain.\n 5) Specific: The responses should be clear to the user."
            ]
      },
      {
            "tag": 69,
            "patterns": [
                  "Same password over multiple accounts",
                  "Should I pick up a random password for multiple accounts ?"
            ],
            "responses": [
                  "In addition to the risks of exposing your password to malware on your own machine, using the same password everywhere puts you at the mercy of the service with the worst security. Hackers take passwords, email addresses, and user names they discover and try to sign in with them at other online services, which works surprisingly often. Different passwords for everything prevents it."
            ]
      },
      {
            "tag": 70,
            "patterns": [
                  "Apple ID password recovery",
                  "How do I reset my login password using my Apple ID?"
            ],
            "responses": [
                  "If you associated your user account with your Apple ID, you can use your Apple ID to reset your login password.\n 1. On your Mac, choose Apple menu > Restart, or press the Power button on your computer and then click Restart.\n 2. Click your user account, click the question mark in the password field, then click the arrow next to “reset it using your Apple ID.”\n 3. Enter an Apple ID and password, then click Next.\n 4. Follow the instructions to reset your login password."
            ]
      },
      {
            "tag": 71,
            "patterns": [
                  "Appple password recovery using recovery key",
                  "How do I reset my login password using a recovery key?"
            ],
            "responses": [
                  "If you turned on FileVault encryption and created a recovery key, you can use the recovery key to reset your login password.\n 1. On your Mac, choose Apple menu > Restart, or press the Power button on your computer and then click Restart.\n 2. Click your user account, click the question mark in the password field, then click the arrow next to “reset it using your recovery key.”\n 3. Enter the recovery key, then click Next.\n 4. Follow the instructions to reset your login password."
            ]
      },
      {
            "tag": 72,
            "patterns": [
                  "Apple passord reset another user",
                  "On Mac, how do I reset the password of another user?"
            ],
            "responses": [
                  "An administrator can reset the passwords of other users.\n 1. On your Mac, choose Apple menu > System Preferences, then click Users & Groups.\n 2. If the lock at the bottom left is locked , click it to unlock the preference pane.\n 3. Select a user, then click Reset Password."
            ]
      },
      {
            "tag": 73,
            "patterns": [
                  "Windows password recovery for Windows 10 version 1803 and later",
                  "How do I recover my password for Windows 10 version 1803 and later ?"
            ],
            "responses": [
                  "1. Select the Reset password link on the sign-in screen. If you use a PIN instead, see PIN sign-in issues. If you're using a work device that's on a network, you may not see an option to reset your password or PIN. In that case, contact your administrator.\n 2. Answer your security questions.\n 3. Enter a new password.\n 4. Sign in as usual with the new password."
            ]
      },
      {
            "tag": 74,
            "patterns": [
                  "Windows password recovery for Windows 10 before version 1803",
                  "How do I recover my password for Windows 10 before version 1803 ?"
            ],
            "responses": [
                  "1. Press the Shift key while you select the Power button > Restart in the lower-right corner of the screen.\n 2. On the Choose an option screen, select Troubleshoot > Reset this PC.\n 3. Select Remove everything."
            ]
      },
      {
            "tag": 75,
            "patterns": [
                  "Password change Zoom",
                  "How do I change the password for Zoom ?"
            ],
            "responses": [
                  "1. Sign in to the Zoom web portal.\n 2. Click Profile.\n 3. Scroll down to Sign In Password, Click Edit on the right.\n 4. Enter your Old Password.\n 5. Enter your New Password, then enter it a second time to confirm.\n Note: Make sure your password meets the requirements.\n 6. Click Save Changes."
            ]
      },
      {
            "tag": 76,
            "patterns": [
                  "Adding password login to Google or Facebook login",
                  "How do I add password login to Google or Facebook login on Zoom?"
            ],
            "responses": [
                  "1. Sign out of your existing Zoom account. \n 2. Go to zoom.us/signup.\n 3. Enter your date of birth for verification.\n 4. Enter in the email address that matches your Google, SSO, or Facebook login.\n 5. Click Sign Up.\n 6. You will receive an email with Sign Up instructions. Click to Activate Account.\n 7. Enter your desired password twice.\n Note: Make sure your password meets the requirements.\n 8. Click Continue.\n 9. You can enter in email addresses of contacts to invite, or choose Skip this Step.\n 10. Click Go to My Account.\n 11. This will take you to My Profile of the existing Zoom account. It should now show the Google, Facebook, and/or SSO icon that displayed previously, as well as an email icon to indicate that you can login with email address and password."
            ]
      },
      {
            "tag": 77,
            "patterns": [
                  "password manager",
                  "Where can I store all my passwords to use later ?"
            ],
            "responses": [
                  "The majority of people use very weak passwords and reuse them on different websites. How are you supposed to use strong, unique passwords on all the websites you use? The solution is a password manager.\n Password managers store your login information for all the websites you use and help you log into them automatically. They encrypt your password database with a master password — the master password is the only one you have to remember."
            ]
      },
      {
            "tag": 78,
            "patterns": [
                  "Google's Password Manager",
                  "Should I use Google's Password Manager ?"
            ],
            "responses": [
                  "Google Password Manager does all the entry-level jobs of a traditional password manager, i.e., saving passwords and autofill info.\n But the best thing about this free tool of Google is the ease of work it offers. You’re not required to download any app or browser extension or even create an additional account for it."
            ]
      },
      {
            "tag": 79,
            "patterns": [
                  "Service Hacked",
                  "What should I do when a service I use has been hacked ?"
            ],
            "responses": [
                  "‘Have I Been Pwned?’ is one of the best tools for checking your email accounts’ safety. You should go to the website and enter each of your email addresses. The site will check if your account has ever been part of a data breach or if your account details have been pasted to the public online. If either of those things is true, you know the account is more at risk.\n You should secure any accounts that are at risk. Use a password generator and password manager, and be sure not to open suspicious emails. It would help if you were vigilant for any suspicious activity on your email account. If you use the same password as the email account anywhere else, change it immediately."
            ]
      },
      {
            "tag": 80,
            "patterns": [
                  "Password written down on paper",
                  "Should I write down my passwords on paper ?"
            ],
            "responses": [
                  "Yes, it’s true writing down all your passwords on paper and keeping that hidden in your home is more secure than a password manager. But that does not mean it’s better. People who write down passwords are more likely to reuse passwords. Password reuse is the worst thing you can do when it comes to passwords.If you used the same password for your bank as you do for some random site, the password is only as strong as the weakest link. If that no name site gets breached so can your bank account. The reason why it’s safe to write down your master password is due to the threat model. It’s less likely someone will break into your home and find your master password to your password manager."
            ]
      },
      {
            "tag": 81,
            "patterns": [
                  "Password manager",
                  "Should I pay for my password manager ?"
            ],
            "responses": [
                  "Luckily for your budget, there’s no big correlation between fees and security here. When paying for a password manager, “you’re not really getting safer — you’re just getting more advanced features, more options,”"
            ]
      },
      {
            "tag": 82,
            "patterns": [
                  "Password Length",
                  "What is the recommended length for any password ?"
            ],
            "responses": [
                  "Longer is better. Traditional eight-character passwords are now easily compromised. A password should be 12 characters at a minimum — ideally 16 or more. Using a multi-word passphrase makes even longer passwords possible and easy to remember."
            ]
      },
      {
            "tag": 83,
            "patterns": [
                  "Dropbox password email",
                  "What should you do If you get a password or email change notification but didn't reset it yourself?"
            ],
            "responses": [
                  "If you unexpectedly received a password or email change notification, first verify that the email really came from Dropbox. To be safe, don't click any links in the email—there's always a chance that the email is a fake, sent by phishers trying to access your Dropbox account.\n Instead, go to dropbox.com and see if you can sign in to your account using your original password. (You may need to sign out first if you're already signed in.)\n - If you can sign in, then your password was never changed, and you should ignore that (likely) fake email. Forward the entire email to abuse@dropbox.com and we'll investigate.\n - If you can't sign in, then you should go to the Dropbox Forgot your password? page and try to reset your Dropbox password as soon as possible. (Don't use a link in the email or any other source to reset your password.)"
            ]
      },
      {
            "tag": 84,
            "patterns": [
                  "LinkedIn password recovery",
                  "How to reset you LinkedIn password using an phone number ?"
            ],
            "responses": [
                  "You can reset your password on the Sign in page.\n 1. Click the Forgot password?.\n 2. Enter an email address or phone number you have on your account.\n 3. We'll send a PIN number to your email.\n 4. Input the PIN number into the appropriate fields on the page."
            ]
      },
      {
            "tag": 85,
            "patterns": [
                  "LinkedIn password recovery",
                  "How to reset you LinkedIn password using an email address ?"
            ],
            "responses": [
                  "You can reset your password on the Sign in page.\n 1. Click the Forgot password?.\n 2. Enter an email address or phone number you have on your account.\n 3. We'll send a PIN number to your email.\n 4. Input the PIN number into the appropriate fields on the page."
            ]
      },
      {
            "tag": 86,
            "patterns": [
                  "Dropbox password recovery",
                  "What should I do if I suspect an unauthorized person accessed my Dropbox account?"
            ],
            "responses": [
                  "If you suspect that an unauthorized person may have accessed your Dropbox account, take the following precautions as soon as possible:\n - Change your Dropbox password on dropbox.com. Be sure to use a strong password that you don't use for any other service.\n - Change the password to the email account you use for your Dropbox account.\n - Remotely sign out of any old, duplicate, or unknown devices on your security page.\n - Also, consider setting up two-step verification, which adds an extra layer of security to your account even if your password is somehow compromised."
            ]
      },
      {
            "tag": 87,
            "patterns": [
                  "PIN code",
                  "What is a PIN? Is it secure?"
            ],
            "responses": [
                  "So, passwords aren't great at keeping accounts protected, but how are PINs different? While a PIN might seem the same as a password when you first think about it (both are something users have to remember), they serve a different purpose.\n PINs are not the same as passwords because they are generally tied to the devices you use. And therein lies the difference between PINs and passwords: local authentication vs. remote authentication. You use a PIN to unlock your device, but you rarely use a password to do that. PINs are largely shorter than passwords (usually 4-6 characters compared to eight-plus), though it's possible to make it longer, if you wish."
            ]
      },
      {
            "tag": 88,
            "patterns": [
                  "Dropbox password recovery",
                  "How to change or reset your Dropbox password from the sign in page?"
            ],
            "responses": [
                  "To reset your Dropbox password when you have access to the email address associated with your account:\n 1. Go to dropbox.com.\n 2. Click Sign in.\n 3. Click Forgot your password? under the Sign in button.\n 4. Enter the email address you used to create the account. Dropbox will send a password reset link to that address. \n 5. Click the link in the email to create a new password."
            ]
      },
      {
            "tag": 89,
            "patterns": [
                  "Dropbox password recovery",
                  "How to reset your Dropbox password from your account settings"
            ],
            "responses": [
                  "To change your password when you’re able to sign in to dropbox.com:\n 1. Sign in to dropbox.com.\n 2. Click your avatar (profile picture or initials) in the top-right corner.\n 3. Click Settings.\n 4. Click the Security tab.\n 5. Click Change password.\n 6. Enter the email address you used to create the account. Dropbox will send a password reset link to that address. \n 7. Click the link in the email to create a new password."
            ]
      },
      {
            "tag": 90,
            "patterns": [
                  "How to change my profile picture on zoom",
                  "I want to change my zoom profile picture"
            ],
            "responses": [
                  "To access your Zoom profile, sign in to the Zoom web portal and click Profile. You can view and edit the following setting:\nProfile Picture: To add or change your profile picture, click Change, then adjust the crop area on your current picture or upload a new one. You can also delete your profile picture by clicking Delete. "
            ]
      },
      {
            "tag": 91,
            "patterns": [
                  "How to enable recording on zoom",
                  "I want to turn on the option for recording on zoom"
            ],
            "responses": [
                  "Sign in to the Zoom web portal.\nClick Settings.\nIn the Recording tab, navigate to the Local Recording option and verify that the setting is enabled.\nIf the setting is disabled, click the toggle to enable it. If a verification dialog displays, click Turn On to verify the change.\nNote: If the option is grayed out, it has been locked at either the group or account level, and you will need to contact your Zoom administrator."
            ]
      },
      {
            "tag": 92,
            "patterns": [
                  "How to record zoom meetings",
                  "I want to record a meeting on zoom"
            ],
            "responses": [
                  "The host must record the meeting or grant the ability to record to a participant.\nStart a Zoom meeting as the host.\nClick the option to Record.\nIf there is a menu, select Record on this Computer.\nClick Participants to see which participants are currently recording.\nNote: Dial-in participants will hear a message informing them that the meeting is now being recorded unless disabled by the host.\n\nAfter the meeting has ended, Zoom will convert the recording so you can access the files.\nOnce the conversion process is complete, the folder containing the recording files will open.\nNote: By default, the audio/video file (MP4) will be named Zoom_0.mp4. The audio only file (M4A) is named audio_only.m4a."
            ]
      },
      {
            "tag": 93,
            "patterns": [
                  "How to turn off chat notifications in zoom",
                  "How to mute chat notifications in zoom"
            ],
            "responses": [
                  "Open Zoom.\nClick the Zoom icon in the top-right side of your screen.\nNext, click Settings.\nNow navigate to the Chat Tab.\nThen scroll down to the Push Notifications section. Here you have two helpful choices:\n- Select Nothing to dismiss all Zoom chat messages immediately,\n- Alternatively, select Only private mentions, to hide all notifications coming from Zoom channels, and receive only those from 1:1 chats."
            ]
      },
      {
            "tag": 94,
            "patterns": [
                  "How to upload my own background in zoom",
                  "I want to use my own background in zoom"
            ],
            "responses": [
                  "Open the app and sign in. \nClick your profile picture, then click on Settings.\nIn the left menu bar, click on the Virtual Background tab (if you don't see this tab, log in to the Zoom website, go to Settings and toggle on Virtual Background).\nIn the Virtual Background tab, select one of Zoom's defaults or upload your own image.\nIf you have a green screen set-up, you can select that option.\nTo add your own image or video, click the + icon to upload from your computer."
            ]
      },
      {
            "tag": 95,
            "patterns": [
                  "How to schedule a WebEx meeting",
                  "I want to schedule a Cisco WebEx meeting"
            ],
            "responses": [
                  "Sign in to your Cisco Webex site, click the drop-down arrow next to Schedule a Meeting, and then select Schedule a Meeting.\n(Optional) If you have any saved meeting templates, you can select one from the Meeting templates.\nAdd the basics by providing the following information:\n- Meeting type—Meeting types are default or customized sets of meeting features available for your site. Your account can have one or more meeting types associated with it.\n- Meeting topic—Choose a topic that people will recognize and get excited about.\n- Meeting password—Use the password that's provided or enter your own. Attendees must enter this password to join your meeting.\n- Date and time—Indicate when the meeting will take place, keeping in mind the time zones of your attendees. You can also set the meeting to repeat daily, weekly, monthly, and so on, by checking the Recurrence check box.\n- Attendees—Enter the email addresses of the people you want to invite to your meeting. If they have an account on this site, you can select  next to their name if you want them to be a cohost.\nIf your site administrator has enabled Tracking Codes, click Edit tracking code to enter the required information.\nClick Show advanced options to customize how people can call into your meeting, add an agenda, and more.\nTo save these settings as a template for future use, click Save as template.\nTo start your meeting right away, click Start; if you're meeting later, click Schedule.\nFor scheduled meetings, you can add the meeting to your calendar by opening the meeting from Meetings > Add to my calendar Add to my calendar. This option appears next to the name of the meeting:\nAn iCalender (.ics) file downloads. Select the .ics file and accept the meeting. To invite others to your meeting, send the .ics file as an email attachment."
            ]
      },
      {
            "tag": 96,
            "patterns": [
                  "How to create breakout rooms in zoom",
                  "I want to create breakout rooms in zoom"
            ],
            "responses": [
                  "Start an instant or scheduled meeting.\nClick Breakout Rooms.\nSelect the number of rooms you would like to create, and how you would like to assign your participants to those rooms:\n- Automatically: Let Zoom split your participants up evenly into each of the rooms.\n- Manually: Choose which participants you would like in each room.\n- Let participants choose room: Participants can select and enter rooms on their own. \nClick Create Breakout Rooms. Your rooms will be created, but will not start automatically.\nTo assign participants to your rooms, select Assign next to the room you wish to assign participants to and select the participants you want to assign to that room. Repeat this for each room.\nOnce a participant has been assigned (manually or automatically), the number of participants will show in place of the Assign button.\nAfter manually or automatically assigning participants to rooms, hover over the participant or room and select Open All Rooms"
            ]
      },
      {
            "tag": 97,
            "patterns": [
                  "How to enable breakout rooms in zoom",
                  "I want to be able to use breakout rooms in zoom"
            ],
            "responses": [
                  "Sign in to the Zoom web portal.\nIn the navigation menu, click Settings.\nNavigate to the Breakout Room option on the Meeting tab and verify that the setting is enabled.\nIf the setting is disabled, click the toggle to enable it. If a verification dialog displays, choose Turn On to verify the change.\n\nNote: If the option is grayed out, it has been locked at either the Group or Account level, and you will need to contact your Zoom administrator.\n(Optional) Click the checkbox to allow meeting hosts to pre-assign participants to breakout rooms."
            ]
      },
      {
            "tag": 98,
            "patterns": [
                  "How do I contact Microsoft Teams users from Skype?",
                  "I want to call microsoft teams users from skype"
            ],
            "responses": [
                  "To connect with a Microsoft Teams user in a one-to-one chat or call:\nOpen the Skype app.\nSelect Search icon People, groups & messages and enter their business email to search for them.\nSelect your contact result from PEOPLE and then send them a message.\nNote: Only certain chat and call functionality will be available.\nAfter they have accepted your request, they will appear in your contact list."
            ]
      },
      {
            "tag": 99,
            "patterns": [
                  "How to join a Microsoft Teams meeting",
                  "I want to join a microsoft teams meeting"
            ],
            "responses": [
                  "All you need to join a Teams meeting is a link.\nSelect Click here to join the meeting in your meeting invite to be taken to a page where you can choose to either join on the web or download the desktop app. If you already have the Teams app, the meeting will open there automatically.\nIf you don’t have a Teams account and the organizer has allowed it, you may have the option to enter your name to join the meeting as a guest. If you do have a Teams account, select Sign in to join with access to the meeting chat and more. Then, depending on the organizer’s settings, you may join the meeting right away or go to the lobby where people in the meeting can admit you."
            ]
      },
      {
            "tag": 100,
            "patterns": [
                  "How to change my video background in Microsoft Teams",
                  "I want to change my background in microsoft teams"
            ],
            "responses": [
                  "If you want to change what appears behind you in your video, you can either blur your background, or replace it entirely with any image you want.\nWhen you're setting up your audio and video before a meeting, select Background filters Background settings (just below the video image). You'll see your background options on the right. \nNote:  If you don't see the option to turn on background effects, the feature might not be available on your device yet."
            ]
      },
      {
            "tag": 101,
            "patterns": [
                  "How to start a call in Microsoft Teams",
                  "I want to make a call in microsoft teams"
            ],
            "responses": [
                  "There are many ways to make a call in Teams\nWherever you are in Teams, you can start a call with someone (or a group of people). Here are some of the ways:\n\nMake or answer a call from anywhere\nSelect either Video call or Audio call. Any call can be a video call or an audio-only call. It's always up to you. \nAnswering a call is simple too. Just select Video call or Audio call when prompted. When someone calls you, you'll get a notification that lets you accept or decline the call.\n\nTurn a chat into a call\nWith one click, you can make any chat into a call in Teams. When you're in a chat, select Video call or Audio cal in the upper-right corner of Teams. The person you are chatting with (or the people, if it's a group chat) will receive a call from you.  \n\nMake a call from your call history, speed dial, voicemail, or contacts\nAccess your call history and quickly call anyone back from the list. Go to Calls and review the History section in the center of the screen. Select any item from the list and then choose Call in the Details section on the right side of Teams.\nFrom your speed dial, you can quickly call people that you previously saved to this list. To access your speed dial, go to Calls and then find the Speed dial section on the right side of Teams.\nFrom your voicemail, you can quickly call back anyone who left a message. To access your voicemail, go to History and select the Voicemail button in the upper-right corner. You can call someone back from your voicemail by selecting More actions next to their name > Call back from the call history list, or by clicking Call under the contact details.\n\nTo view your contacts, click Calls > Contacts in the upper-left of Teams. From here, you can call anyone by selecting Call to the right of their name."
            ]
      },
      {
            "tag": 102,
            "patterns": [
                  "How to schedule a microsoft teams meeting",
                  "I want to schedule a meeting in microsoft teams"
            ],
            "responses": [
                  "There are several ways to schedule a meeting in Teams:\nSelect Schedule a meeting in a chat (below the box where you type a new message) to book a meeting with the people in the chat.\nGo to Calendar on the left side of the app and select New meeting in the top right corner. Select a range of time in the calendar. A scheduling form will pop open.\nThe scheduling form is where you'll give your meeting a title, invite people, and add meeting details. Use the Scheduling Assistant to find a time that works for everyone.\nOnce you're done filling out the details, select Save. This will close the scheduling form and send an invite to everyone's Outlook inbox."
            ]
      },
      {
            "tag": 103,
            "patterns": [
                  "How to invite people outside your organization to your microsoft teams meeting",
                  "I want to invite people to my microsoft teams meeting"
            ],
            "responses": [
                  "Teams lets you invite people outside your organization, including those who don't have a Teams license. You'll need their full email address to invite them.\nGo to where it says Add required attendees. If anyone is an optional attendee, select Optional instead.\nType the person's full email address (ex: Joe@example.com).\nSelect Invite. They'll receive an email with a link to the meeting."
            ]
      },
      {
            "tag": 104,
            "patterns": [
                  "How to start an instant meeting in microsoft teams",
                  "I want to start a new meeting in microsoft teams"
            ],
            "responses": [
                  "Go to Calendar on the left side of Teams, then select Meet now in the upper right corner.\nYou'll have a chance to set a few things up before you start your meeting. Give it a title, choose whether you want to use video, and pick your preferred audio source.\nWhen you're ready, hit Join now.\nYour meeting is now up and running—you just need people to join you. \n\nTo invite people:\nStart typing the name or phone number of someone you want to invite in the box under People in the top right. Select them when they appear in the list, and they'll get a call right away\nAnother option is to copy the meeting link and send it to anyone you want to meet with, and they can join by selecting it. Just choose Copy join info and paste the link in a message."
            ]
      },
      {
            "tag": 105,
            "patterns": [
                  "How to share your screen in microsoft teams",
                  "I want to share content in microsoft teams"
            ],
            "responses": [
                  "To share your screen in a meeting, select Share content in your meeting controls. Then, choose to present your entire screen, a window, a PowerPoint file, or a whiteboard.\nTo share sound, select Include computer sound (it's the switch on the top right of your sharing options). All sound from your computer, including notifications, will be audible in the meeting.\nNotes: \n- If you're using Teams on the web, you'll be able to share your screen only if you're using Google Chrome or the latest version of Microsoft Edge.\n- If you're using a Mac, you'll need to grant permission to Teams to record your computer's screen before you can share. \nYou'll be prompted to grant permission the first time you try to share your screen. Select Open System Preferences from the prompt.\nIf you miss the prompt, you can do this anytime by going to Apple Menu > System Preferences > Security & Privacy.\nUnder Screen Recording, make sure Microsoft Teams is selected.\nGo back to your meeting and try sharing your screen again.\n\nNote: If you're using Teams on the web, make sure you've also granted screen recording permission to your browser."
            ]
      },
      {
            "tag": 106,
            "patterns": [
                  "How to enable live captions in microsoft teams",
                  "I want to see captions when someon is speaking in microsoft teams"
            ],
            "responses": [
                  "Teams can detect what’s said in a meeting and present real-time captions. And, if you've turned on the new meeting experience, your captions will include speaker attribution—so you'll see not only what's being said, but who's saying it. \n\nTo use live captions in a meeting, go to your meeting controls and select More options > Turn on live captions.\nTo stop using live captions, go to the meeting controls and select More options > Turn off live captions.\nNotes: \nCaptions are available only in English (US) for now.\nPeople can choose to not be identified in captions."
            ]
      },
      {
            "tag": 107,
            "patterns": [
                  "How to record a microsoft teams meeting",
                  "I want to record a meeting in microsoft teams"
            ],
            "responses": [
                  "To start recording, go to the meeting controls and select More options > Start recording and transcription.\nEveryone in the meeting is notified that recording and transcription has started. The meeting notification is also posted to the chat history.\nNotes: \nYou can't make multiple recordings of the same meeting at the same time. If one person starts recording a meeting, that recording will be stored on the cloud and available to all participants.\nMeeting participants have the option of viewing the transcription during the meeting.\n\nTo stop recording, go to the meeting controls and select More options > Stop recording and transcription.\nThe recording is then processed and saved to SharePoint if it was a channel meeting, or OneDrive if it was any other type of meeting. \nThe meeting recording shows up in the meeting chat—or in the channel conversation, if you’re meeting in a channel. The recording doesn't expire."
            ]
      },
      {
            "tag": 108,
            "patterns": [
                  "How to create breakout rooms in microsoft teams",
                  "I want to create breakout rooms in microsoft teams"
            ],
            "responses": [
                  "Start the meeting.\nIn the meeting controls, select Breakout rooms.\nSelect the number of rooms you want (50 max), and whether you want Teams to assign people to rooms (Automatically) or you want to choose the people for each room yourself (Manually).\nNote: This is the only time you can choose to have people automatically assigned to breakout rooms. You won't be able to change this option later in the meeting.\nSelect Create Rooms."
            ]
      },
      {
            "tag": 109,
            "patterns": [
                  "How to assign people to breakout rooms in microsoft teams",
                  "I want to assign participants to breakout rooms in microsoft teams"
            ],
            "responses": [
                  "Select Assign participants.\nChoose the people who will share a breakout room by selecting the check boxes next to their names.\nSelect Assign and then select a room for those people.\nRepeat steps the previous two steps until everyone has been assigned to a room."
            ]
      },
      {
            "tag": 110,
            "patterns": [
                  "How to screen share from iPad or iPhone to zoom on computer",
                  "I want to share screen on my iphone or ipad in zoom"
            ],
            "responses": [
                  "In the meeting controls, tap Share Content. The meeting controls will be at the bottom of your screen on an iPhone and the top right of your screen on an iPad.\nTap Screen. Then, swipe left on the instructions to see the Broadcast to Zoom instructions.\nAccess the Control Center.\n- On iPhone 8 or older or iPads running iOS 11, swipe up from the bottom.\n- On iPhone X or iPads running iOS 12, swipe down from the top right. \nHold down on the record button until the Screen Recording option appears.\nThen, tap Zoom > Start Broadcast.\nAfter a count of 3, your entire device screen will be shared into the meeting.\nTap the red bar at the top of your screen when you are ready to end the share. Tap Stop. \nTap the red bar again to open Zoom."
            ]
      },
      {
            "tag": 111,
            "patterns": [
                  "How to change my background on WebEx",
                  "I want to change my video background in cisco webex"
            ],
            "responses": [
                  "Before You Join\nClick Change Background and then do one of the following:\n- To blur your surroundings while remaining in focus, click Blur.\n- To use a default virtual background, click the one you want.\n- To use your own image for the virtual background, tap the + icon.\nIt is recommended that you use an image that's 1280 × 720 pixels in size or larger. Images must be in the .jpg or .png format.\n\nDuring a Meeting\nIn your self-view window, click the Video options icon, choose Change Virtual Background, and do one of the following:\n- To blur your surroundings while remaining in focus, click Blur.\n- To use a default virtual background, click the one you want.\n- To use your own image for the virtual background, tap the + icon.\nWhen you're ready for everyone in the meeting to see your background, click Apply. Webex remembers your selection for your next meeting."
            ]
      },
      {
            "tag": 112,
            "patterns": [
                  "How to share screen in cisco WebEx",
                  "I want to share content in cisco webex"
            ],
            "responses": [
                  "To share content during a meeting, from the meeting control panel, select Share.\nSelect which window you want to share.\nGo to the Share menu for more sharing options."
            ]
      },
      {
            "tag": 113,
            "patterns": [
                  "How to record a cisco WebEx meeting",
                  "I want to record a meeting in cisco webex"
            ],
            "responses": [
                  "While in your meeting, click Record, and then Record to record right away. You and your participants see a red icon at the top right of your window when recording is in process.\nWhen the meeting ends, you can find your recording on the Recordings > My Recorded Meetings page of your Webex site. If you recorded in the cloud, when the meeting ends, you receive an email with the recording link. Depending on file size and bandwidth, it can take up to 24 hours to receive your recording."
            ]
      },
      {
            "tag": 114,
            "patterns": [
                  "How to start a group conversation in Google Hangouts",
                  "I want to create a group chat in google hangouts"
            ],
            "responses": [
                  "Go to hangouts.google.com or open classic Hangouts in Gmail.\nClick New conversation Add to playlist  and then New group .\nEnter the names or email addresses of the people you want to add and click Done .\nOptional: Name your group."
            ]
      },
      {
            "tag": 115,
            "patterns": [
                  "How to start a group call in a group message in google hangouts",
                  "I want to start a group vall in google hangouts"
            ],
            "responses": [
                  "Go to hangouts.google.com or open the app from the sidebar in Gmail.\nSelect a group to call from the Hangouts list or create a new group. \nAt the top left of the group message window, click Video call .\nHangouts automatically adds a Meet link to your message. Click Send  to share the link and invite the group to the Google Meet video call."
            ]
      },
      {
            "tag": 116,
            "patterns": [
                  "How to add a person to a hangouts group",
                  "I want to add someone to my google hangouts group"
            ],
            "responses": [
                  "When someone is added to a group, they can access past messages in the conversation. \nGo to hangouts.google.com or open Hangouts in Gmail.\nSelect a group conversation.\nClick People People.\nAt the bottom, click Add people. \nType the name or email address of the person you want to add.\nClick Add people."
            ]
      },
      {
            "tag": 117,
            "patterns": [
                  "Is zoom free to use",
                  "What are the zoom payment options"
            ],
            "responses": [
                  "There are 3 types of users:\nBasic: A basic user is a user without a paid license. Basic users can be on Basic (free) plans, as well as paid plans such as Pro or Business. A basic user on a Basic plan can host meetings with up to 100 participants. A basic user on a paid account inherits the account's default meeting capacity, such as a Business account's default meeting capacity of 300. If 3 or more participants join, the meeting will time out after 40 minutes. They cannot utilize user and account add-ons such as large meeting, webinar, or conference room connector.\n\nLicensed: A licensed user is a paid account user who can host unlimited meetings on the public cloud. By default, they can host meetings with up to 100 participants and large meeting licenses are available for additional capacity. Licensed users have these additional features available:\n- Customize Personal Meeting ID\n- Record to the Zoom cloud\n- Be an alternative host\n- Assign others to schedule and schedule on behalf of\n- Utilize account add-ons such as conference room connector\n- Be assigned user add-ons such as large meeting, webinar, or personal audio conference\n- Customize Personal Link, if on a business or education account\n\nOn-prem: An on-prem user is a paid account who can host unlimited meetings with the on-premise meeting connector. On-prem users have these additional features:\n- Customize Personal Meeting ID\n- Use the recording connector, if configured for their account\n- Be an alternative host\n- Assign others to schedule and schedule on behalf of\n- Utilize account add-ons such as room connector\n- Be assigned user add-ons such as large meeting, webinar, or personal audio conference\n- Customize Personal Link, if on a business or education account\n\nYou can find your user type on your profile page. If you are an admin or account owner, you can view user types for all users under your account on the User Management page. "
            ]
      },
      {
            "tag": 118,
            "patterns": [
                  "Is microsoft teams free",
                  "Do you have to pay for microsoft teams"
            ],
            "responses": [
                  "Yes! The free version of Teams includes the following:\n- Unlimited chat messages and search.\n- Built-in online meetings and audio and video calling for individuals and groups, with a duration of up to 60 minutes per meeting or call. For a limited time, you can meet for up to 24 hours.\n- 10 GB of team file storage plus 2 GB per person for personal storage.\n- Integrated, real-time content creation with Office apps like Word, Excel, PowerPoint, and OneNote.\n- Unlimited app integrations with more than 650 business apps to choose from, including Adobe Sign, Evernote, and Trello.\n- Ability to communicate and collaborate with anyone inside or outside your organization, backed by Microsoft’s secure, global infrastructure."
            ]
      },
      {
            "tag": 119,
            "patterns": [
                  "Is Cisco Webex free",
                  "Do you have to pay to use Cisco Webex"
            ],
            "responses": [
                  "Cisco Webex has a free version that comes with the following features:\n- 1 host\n- Up to 50 min meeting time\n- Up to 100 participants\n- Screen sharing\n- Support for iPhone, iPad, Android, and wearable devices\n- Meeting Scheduling\n- Meeting Recording\n- Breakout sessions\n- Lock personal meeting rooms\n- End-to-end encryption option"
            ]
      },
      {
            "tag": 120,
            "patterns": [
                  "How to show my profile picture when my video is off in zoom",
                  "I want my profile picture to show when my video is off in zoom"
            ],
            "responses": [
                  "If you are already in a Zoom meeting, right-click on your video preview screen. Choose Add or Edit Profile Picture from the menu. Stop the video, and you will see your picture."
            ]
      },
      {
            "tag": 121,
            "patterns": [
                  "What are the zoom keyboard shortcuts",
                  "I want to edit keyboard shortcuts in zoom"
            ],
            "responses": [
                  "You can view and edit keyboard shortcuts in your Keyboard Shortcuts settings.\nSign in to the Zoom desktop client.\nClick your profile picture then click Settings.\nClick Keyboard Shortcuts.\nThe keyboard shortcuts will appear.\n\nEditing shortcuts\nYou can edit a shortcut by clicking on the shortcut and then pressing the shortcut key that you would like to use. \nSome of the shortcuts can be used as global shortcuts, meaning they will work even when Zoom is not in focus. To enable a shortcut globally, check the option next to the shortcut."
            ]
      },
      {
            "tag": 122,
            "patterns": [
                  "How to use dark mode in zoom",
                  "I want to use zoom dark mode on my windows or mac"
            ],
            "responses": [
                  "Zoom dark mode for Windows\nThe Zoom desktop app doesn't offer dark mode, but you can force dark mode if you join a Zoom meeting using Chrome. To give it a try, visit chrome://flags/#enable-force-dark and choose one of the non-default options. Select 'Enabled with selected inversion of everything'. Save any work in other browser tabs and click 'Re-launch' to activate the change'.\nTo reverse the change, simply go back to chrome://flags/#enable-force-dark and change the setting back to 'Default', then re-launch the browser.\n\nZoom dark mode for macOS\nThe Zoom app for macOS respects your operating system's settings, so to activate dark mode you can simply open your system preferences, select 'General' and select the 'Dark' appearance option. This will change the look of your whole OS, and all supported apps.\nTo reverse the change and return macOS to its previous look, simply repeat the process and select the 'Light' appearance option."
            ]
      },
      {
            "tag": 123,
            "patterns": [
                  "How do I download Zoom",
                  "I want to download Zoom"
            ],
            "responses": [
                  "Visit the Zoom download portal and download the necessary version of Zoom: https://zoom.us/download"
            ]
      },
      {
            "tag": 124,
            "patterns": [
                  "Is Zoom free",
                  "Do I have to pay for Zoom"
            ],
            "responses": [
                  "Zoom's basic free version is available free of charge"
            ]
      },
      {
            "tag": 125,
            "patterns": [
                  "How do I start a Zoom meeting",
                  "I want to start a Zoom meeting"
            ],
            "responses": [
                  "In the Zoom desktop client, under the home tab, click new meeting"
            ]
      },
      {
            "tag": 126,
            "patterns": [
                  "How can I share my Zoom invite",
                  "I want to share my Zoom invite"
            ],
            "responses": [
                  "Click Copy Invite Link or Copy Invitation if you want to send your instant meeting information elsewhere."
            ]
      },
      {
            "tag": 127,
            "patterns": [
                  "How can I update Zoom",
                  "I want to update Zoom"
            ],
            "responses": [
                  "In the Zoom desktop client, click your profile picture then click Check for Updates"
            ]
      },
      {
            "tag": 128,
            "patterns": [
                  "What version of Zoom am I running",
                  "I want to see what version of Zoom I am running"
            ],
            "responses": [
                  "In the Zoom desktop client, click your profile picture then click Check for Updates"
            ]
      },
      {
            "tag": 129,
            "patterns": [
                  "Is there reactions in Zoom",
                  "I want to react in Zoom"
            ],
            "responses": [
                  "To react during a meeting, simply click/tap on the ‘Reactions’ button and hit either of the emojis. The selected emoji will be shown at the top-left corner of your Zoom client (PC)."
            ]
      },
      {
            "tag": 130,
            "patterns": [
                  "How do I chat with members in my Zoom",
                  "I want to use the chat in Zoom"
            ],
            "responses": [
                  "While in a Zoom meeting, click Chat in the meeting controls, this will open the chat window. You can type a message into the chat box"
            ]
      },
      {
            "tag": 131,
            "patterns": [
                  "How can I send a private message in Zoom",
                  "I want to send a private message in Zoom"
            ],
            "responses": [
                  "While in a Zoom meeting, click Chat in the meeting controls, this will open the chat window. You can type a message into the chat box or click on the drop down next to To: if you want to send a message to a specific person."
            ]
      },
      {
            "tag": 132,
            "patterns": [
                  "How can I mute myself in a Zoom",
                  "I want to mute myself in Zoom"
            ],
            "responses": [
                  "To mute yourself, click the Mute button (microphone). A red slash will appear over the microphone icon indicating that your audio is now off."
            ]
      },
      {
            "tag": 133,
            "patterns": [
                  "How can I turn on my camera in a Zoom",
                  "I want to turn on my camera in Zoom"
            ],
            "responses": [
                  "Click the Start Video button in the menu bar at the bottom of the window to begin your video stream."
            ]
      },
      {
            "tag": 134,
            "patterns": [
                  "How can I change my view of other Zoom participants",
                  "I want to change the view in Zoom"
            ],
            "responses": [
                  "Within a Zoom meeting, click View in the top-right corner, and then select Speaker or Gallery"
            ]
      },
      {
            "tag": 135,
            "patterns": [
                  "How to share my screen in Zoom",
                  "I want to share my screen in Zoom"
            ],
            "responses": [
                  "Click the Share Screen button located in your meeting controls and select your desired option"
            ]
      },
      {
            "tag": 136,
            "patterns": [
                  "How can I assign the host to someone else in Zoom",
                  "I want to change my Zoom's host"
            ],
            "responses": [
                  "As host in Zoom desktop client, click end in host controls, click leave meeting, and then assign someone to be the new host, then clicking assign and leave"
            ]
      },
      {
            "tag": 137,
            "patterns": [
                  "How do I pin a participant in Zoom",
                  "I want to pin a participant in Zoom"
            ],
            "responses": [
                  "Hover over the video of a participant and from the menu, click Pin"
            ]
      },
      {
            "tag": 138,
            "patterns": [
                  "How to mute participants in my Zoom meeting",
                  "I want to mute participants in Zoom"
            ],
            "responses": [
                  "Click participants in meeting controls, then click mute all"
            ]
      },
      {
            "tag": 139,
            "patterns": [
                  "How do I make a poll in Zoom",
                  "I want to make a poll in Zoom"
            ],
            "responses": [
                  "If polls is enabled within your Zoom settings, select Poll in the meeting controls and customize accordingly"
            ]
      },
      {
            "tag": 140,
            "patterns": [
                  "How do I join a Microsoft Teams meeting",
                  "I want to join a Microsoft Teams meeting"
            ],
            "responses": [
                  "Go to the meeting invite and select Join Microsoft Teams Meeting, that'll open a web page, where you'll see two choices: Download the Windows app and Join on the web instead. If you join on the web, you can use either Microsoft Edge or Google Chrome. Your browser may ask if it's okay for Teams to use your mic and camera. Be sure to allow it so you'll be seen and heard in your meeting.  Enter your name and choose your audio and video settings. If the meeting room (or another device that's connected to the meeting) is nearby, choose Audio off to avoid disrupting. Select Phone audio if you want to listen to the meeting on your mobile phone.  Then select join now, where you will be admitted to the meeting lobby."
            ]
      },
      {
            "tag": 141,
            "patterns": [
                  "How do I unmute in Microsoft Teams",
                  "I want to unmute myself in Microsoft Teams"
            ],
            "responses": [
                  "To unmute yourself, click on the Microphone Icon again (make sure there is not a slash through the microphone)"
            ]
      },
      {
            "tag": 142,
            "patterns": [
                  "How do I turn on my camera in Microsoft Teams",
                  "I want to turn on my camera in Microsoft Teams"
            ],
            "responses": [
                  "To turn on your video before a meeting, just select Camera right before you join."
            ]
      },
      {
            "tag": 143,
            "patterns": [
                  "Can I share my screen in Microsoft Teams",
                  "I want to share my camera in Microsoft Teams"
            ],
            "responses": [
                  "Select Share content and choose if you want to share your computer audio, then select what content you would like to share."
            ]
      },
      {
            "tag": 144,
            "patterns": [
                  "Can I use Zoom from a mobile device",
                  "I want to use Zoom on a mobile device"
            ],
            "responses": [
                  "You can use Zoom to participate in or host video meetings on your computer or mobile device."
            ]
      },
      {
            "tag": 145,
            "patterns": [
                  "Where can I download Microsoft Teams",
                  "I want to download Microsoft Teams"
            ],
            "responses": [
                  "Select what version of Teams you would like to download from: \nhttps://www.microsoft.com/en-us/microsoft-teams/download-app"
            ]
      },
      {
            "tag": 146,
            "patterns": [
                  "How can I make contacts in Zoom",
                  "I want to add a contact in Zoom"
            ],
            "responses": [
                  "From the Zoom desktop client, select Contacts, press the plus sign, and enter in an email, then select Add Contact."
            ]
      },
      {
            "tag": 147,
            "patterns": [
                  "How can I change my status on Zoom",
                  "I want to change my status in Zoom"
            ],
            "responses": [
                  "In the Zoom desktop client select your profile picture, then click your status."
            ]
      },
      {
            "tag": 148,
            "patterns": [
                  "How can I see my Zoom encryption algorithm",
                  "I want to see my Zoom encryption algorithm"
            ],
            "responses": [
                  "In the Zoom desktop client, under your profile picture, select settings, and select the statistics tab."
            ]
      },
      {
            "tag": 149,
            "patterns": [
                  "How much memory is Zoom using",
                  "Zoom memory usage"
            ],
            "responses": [
                  "In the Zoom desktop client, under your profile picture, select settings, and select the statistics tab."
            ]
      },
      {
            "tag": 150,
            "patterns": [
                  "Why is my Zoom choppy",
                  "Zoom is choppy"
            ],
            "responses": [
                  "Poor WiFi connectivity leads to a slow Zoom meeting"
            ]
      },
      {
            "tag": 151,
            "patterns": [
                  "What bandwidth do I need for video conferencing",
                  "Video conferencing bandwidth"
            ],
            "responses": [
                  "The minimum bandwidth required for video conferencing that's effective is 8Mbps for downloading and 1.5 Mbps for uploading."
            ]
      },
      {
            "tag": 152,
            "patterns": [
                  "How many people can participate in a Zoom",
                  "Zoom maximum participants"
            ],
            "responses": [
                  "Zoom participants depends on your subscription plan."
            ]
      },
      {
            "tag": 153,
            "patterns": [
                  "What is a Zoom webinar",
                  "Zoom webinar"
            ],
            "responses": [
                  "Zoom Video Webinar allows you to broadcast a Zoom meeting to up to 10,000 view-only attendees, depending on the size of your webinar license. ... Webinars can be held once, can reoccur in a series, or can be the same session held multiple times."
            ]
      },
      {
            "tag": 154,
            "patterns": [
                  "Can I use Zoom without a camera",
                  "I want to use Zoom without a camera"
            ],
            "responses": [
                  "While you are not required to have a webcam to join a Zoom Meeting or Webinar, you will not be able to transmit video of yourself."
            ]
      },
      {
            "tag": 155,
            "patterns": [
                  "Can I use Zoom without a microphone",
                  "I want to use Zoom without a microphone"
            ],
            "responses": [
                  "Yes, you can attend a Zoom meeting without a microphone"
            ]
      },
      {
            "tag": 156,
            "patterns": [
                  "What are some free platforms for online conferences",
                  "Free applications for online meetings"
            ],
            "responses": [
                  "GoToMeeting, Cisco Webex, TeamViewer, Skype, Join.Me, Zoom, Apache OpenMeeting, Google Hangouts"
            ]
      },
      {
            "tag": 157,
            "patterns": [
                  "How to use virtual backgrounds in Google Meet",
                  "I want virtual backgrounds in Google Meet"
            ],
            "responses": [
                  "Before a video call: Go to Google Meet, select a meeting > Change Background (bottom right of self view) > Join Now. During a video call: click More (three vertical dots at the bottom) > Change Background."
            ]
      },
      {
            "tag": 158,
            "patterns": [
                  "Does Google Meet have reactions",
                  "I want to react in Google Meet"
            ],
            "responses": [
                  "You can't do that at this moment, but you can try by installing extensions from Chrome Web Store"
            ]
      },
      {
            "tag": 159,
            "patterns": [
                  "Where to change sound settings in Google Meet",
                  "I want to change the volume in Google Meet"
            ],
            "responses": [
                  "Go to https://meet.google.com/ (before a meeting) or select More (during a meeting), select Settings > Audio > Microphone or Speakers > Test (optional) > Done"
            ]
      },
      {
            "tag": 160,
            "patterns": [
                  "How to enter a Google Meet meeting with a different email",
                  "I keep entering Google Meet with the same email address"
            ],
            "responses": [
                  "Click on the profile picture in the Google Meet tab, choose the account you want to switch too and Add An Account if it's not there"
            ]
      },
      {
            "tag": 161,
            "patterns": [
                  "How to conduct polls in Google Meet",
                  "I want to make polls in Google Meet"
            ],
            "responses": [
                  "In a meeting, click Activities (top-right corner) > Polls > Start a poll > Enter questions and add options > Launch (to post your poll) or Save (to post it later)"
            ]
      },
      {
            "tag": 162,
            "patterns": [
                  "How to show poll results in Google Meet",
                  "I want to show poll results in Google Meet"
            ],
            "responses": [
                  "In a meeting, click Activities (top-right corner) > Polls > Switch on Show everyone the results"
            ]
      },
      {
            "tag": 163,
            "patterns": [
                  "How to close a poll in Google Meet",
                  "I want to close a poll in Google Meet"
            ],
            "responses": [
                  "In a meeting, click Activities (top-right corner) > Polls > End the poll"
            ]
      },
      {
            "tag": 164,
            "patterns": [
                  "How to view poll results later in Google Meet",
                  "I want to view poll results after meeting in Google Meet"
            ],
            "responses": [
                  "After a meeting, the moderator is emailed a report for any polls conducted in the meeting. The report includes the names and answers of the meeting participants. Open the poll report email and click the report attachment."
            ]
      },
      {
            "tag": 165,
            "patterns": [
                  "How to find a meeting time that works for everyone",
                  "I want to find the best meeting time"
            ],
            "responses": [
                  "Suggested times feature: In Google Calendar, create a new event, or open an existing event  > Add guests (if you haven’t already done so) and then click Suggested times > Choose a time in the resulting list. Find a time feature (If the other guests have shared their calendar with you): In Google Calendar, create a new event, or open an existing event > Add guests (if you haven’t already done so) and then click the tab Find a time > Use the arrows at the top to navigate between days > Once you have found a time, click the area within the calendar grid > Save"
            ]
      },
      {
            "tag": 166,
            "patterns": [
                  "Does Google Meet have filters",
                  "Where can I apply filters in Google Meet?"
            ],
            "responses": [
                  "No, but if you still want filters, you can download Snap Camera at https://yourstack.com/products/TheSnapCamera. Before your next Google Meet call, go to Settings > Video > and change the source to Snap Camera."
            ]
      },
      {
            "tag": 167,
            "patterns": [
                  "How to attach files in Google Meet",
                  "I want to send files in Google Meet"
            ],
            "responses": [
                  "In a Meet video call, in the lower-left corner, click the meeting name > Attachments, then select the files "
            ]
      },
      {
            "tag": 168,
            "patterns": [
                  "Does Google Meet have breakout rooms",
                  "I want to have breakout rooms in Google Meet"
            ],
            "responses": [
                  "Yes. In a Meet video call, click Activites in the top right > Breakout rooms. Choose a number of breakout rooms (up to 100). To manually move people into different rooms, you can one of the followings: (1) Enter the participant’s name directly into a breakout room, (2) Click the participant’s name. Hold down the mouse, drag the name, and then drop it into another breakout room (3)To randomly mix up the groups again, click Shuffle. Click Open rooms to finish. "
            ]
      },
      {
            "tag": 169,
            "patterns": [
                  "How can I raise hands in Google Meet",
                  "I want to raise hands in Google Meet"
            ],
            "responses": [
                  "Scroll to the bottom of the screen and then click Hand raise "
            ]
      },
      {
            "tag": 170,
            "patterns": [
                  "How many people can a Google Meet meeting have",
                  "I want to know the max number of people in a Google Meet meeting"
            ],
            "responses": [
                  "100 participants"
            ]
      },
      {
            "tag": 171,
            "patterns": [
                  "How to share screen in Google Meet",
                  "I want to share my screen in Google Meet"
            ],
            "responses": [
                  "In a Meet video call, on the bottom, select Present now. Select Your entire screen, A window, or A tab. Select Share"
            ]
      },
      {
            "tag": 172,
            "patterns": [
                  "Can many people share screens at the same time in Google Meet",
                  "I want to share my screen at the same time as someone else"
            ],
            "responses": [
                  "Only one person may share their screen at a time"
            ]
      },
      {
            "tag": 173,
            "patterns": [
                  "How to record a meeting in Google Meet",
                  "I want to record my Google Meet meeting"
            ],
            "responses": [
                  "In a meeting, click More (three vertical dots) > Record meeting. Wait for the recording to start."
            ]
      },
      {
            "tag": 174,
            "patterns": [
                  "What are the differences between Zoom and Google Meet",
                  "Compare Zoom and Google Meet"
            ],
            "responses": [
                  "The basic plans of both platforms are free, can handle up to 100 people in a meeting, and with only 1 host. Maximum time of a Zoom meeting is 40 min, while that of Google Meet is 60 min."
            ]
      },
      {
            "tag": 175,
            "patterns": [
                  "How to annotate in Zoom",
                  "I want to draw or annotate in Zoom"
            ],
            "responses": [
                  "Sign into Zoom web portal and go to the Settings tab. For a single account, in navigation, click Account Management > Account Settings (for a single account); for a group of users, in navigation, clickUser Management > Group Management, choose the group name, then click the Settings tab. Then click Meeting tab > under In Meeting (basic), enable Annotation. If a verification dialog displays, click Turn On to verify the change."
            ]
      },
      {
            "tag": 176,
            "patterns": [
                  "How to join a Zoom meeting from web browser",
                  "I don't want to download Zoom"
            ],
            "responses": [
                  "Sign into Zoom web portal and go to the Settings tab. For a single account, in navigation, click Account Management > Account Settings (for a single account); for a group of users, in navigation, clickUser Management > Group Management, choose the group name, then click the Settings tab. Click Meeting tab >  enable Show a \"Join from your browser\" Link. If a verification dialog displays, choose Turn On to verify the change."
            ]
      },
      {
            "tag": 177,
            "patterns": [
                  "Can I attend multiple Google Meet",
                  "I want to join many Google Meet meetings"
            ],
            "responses": [
                  "Yes, you should be able to join multiple meetings at the same time. I would expect the main limitation would be your computer's processing power and your bandwidth. "
            ]
      },
      {
            "tag": 178,
            "patterns": [
                  "How to automatically mute myself in Google Meet",
                  "I don't want to use my mic in Google Meet"
            ],
            "responses": [
                  "Before you join any meeting on Google Meet, you might have noticed a ‘Join Screen’ which checks for your Mic and Cam before joining. But if we are already disabling Mic and Camera by default, there is no point in keeping the ‘Join Screen’ as well. You can do that by installing an extension called Google Meet Enhanced Suite. This extension is a one-stop destination for many features on the Google Meet like the push to talk, dark mode, timer, PIP mode, muting other participants for you, etc along with auto disabling mic and cam and also disabling the join screen."
            ]
      },
      {
            "tag": 179,
            "patterns": [
                  "How to automatically turn of my camera in Google Meet",
                  "I don't want to turn my camera on in Google Meet"
            ],
            "responses": [
                  "As soon as you run the Google Meet app, your camera will turn on and you’ll likely see yourself. If you want to make sure that your camera isn’t recording, tap or click the camera icon in the bottom part of the screen."
            ]
      },
      {
            "tag": 180,
            "patterns": [
                  "Can I use a whiteboard in Google Meet",
                  "I need whiteboard in Google Meet"
            ],
            "responses": [
                  "In the video call at the bottom, click More options More > Whiteboard. To create a new Jamboard, click Start a new whiteboard. To open an existing Jamboard from your drive, shared drives, or computer, click Choose from Drive. "
            ]
      },
      {
            "tag": 181,
            "patterns": [
                  "How to change camera settings in Google Meet",
                  "I want to change my video settings in Google Meet"
            ],
            "responses": [
                  "Go to https://meet.google.com/. Click Settings > Video. Choose a setting you want to change: Camera, Send resolution, or Receive Resolution."
            ]
      },
      {
            "tag": 182,
            "patterns": [
                  "How to turn on Google Meet notifications",
                  "I want to receive notifications from Google Meet"
            ],
            "responses": [
                  "On your computer, open Chrome. At the top right, click More > Settings. Under Privacy and security, click Site settings. Click Notifications. Select the Meet entry and click More > Allow."
            ]
      },
      {
            "tag": 183,
            "patterns": [
                  "Why my video quality is bad in Google Meet",
                  "I want to improve my video quality in Google Meet"
            ],
            "responses": [
                  "Poor video quality can be due to network issues or insufficient lighting in the room. To identify the problem: Make sure that the sender and receiver devices have enough CPU power and memory; Narrow down the issue as much as possible, such as to a location or network segment; Identify if the issue is on the sender or receiver side; Reduce bandwidth usage by setting the default for video quality."
            ]
      },
      {
            "tag": 184,
            "patterns": [
                  "How to mute background noise on Google Meet",
                  "I don't want background noise in Google Meet"
            ],
            "responses": [
                  "If before a video call: go to meet.google.com and select a video call. Before you join, click More > Settings > Audio. Turn on Noise cancellation > Join now. If during a video call: click More > Setitngs > Audio, and turn on Noise cancellation."
            ]
      },
      {
            "tag": 185,
            "patterns": [
                  "How to save a Google Meet chat",
                  "I want to save the chat in Google Meet"
            ],
            "responses": [
                  "You can't save chat. If the teacher is recording the meeting then chat will be saved."
            ]
      },
      {
            "tag": 186,
            "patterns": [
                  "How to see participants list in Google Meet",
                  "I want to see who attend the Google Meet meeting"
            ],
            "responses": [
                  "You have to enable attendance tracking by 2 ways: during a meeting or with Google Calendar. First way: click Menu (three vertical dots) > Settings > Host Controls, then Enable Attendance tracking. Second way: create a new event > Add Google Meet video conferencing or click an existing meeting > Edit event. Click Change conference Settings. Check the box next to \"Attendance tracking\" > Save. Finish setting up your event if you just create one. You will receive a report through email after the meeting."
            ]
      },
      {
            "tag": 187,
            "patterns": [
                  "Is there a Google Meet app on desktop",
                  "I want to download Google Meet"
            ],
            "responses": [
                  "Google Meet only have mobile apps."
            ]
      },
      {
            "tag": 188,
            "patterns": [
                  "Is Google Meet free",
                  "Do I have to pay for Google Meet"
            ],
            "responses": [
                  "Yes, but you won't have these features: dial-in phone numbers, meeting recording saved to Google Drive, hand raise, polls and Q&A, breakout rooms, attendance reports, intelligent noise cancellation, and live streaming in-domain."
            ]
      },
      {
            "tag": 189,
            "patterns": [
                  "Are there Google Meet discounts",
                  "Can I have discounts for Google Meet"
            ],
            "responses": [
                  "Yes, if your organization is non-profit, you can use Google Workspace for free. "
            ]
      },
      {
            "tag": 190,
            "patterns": [
                  "What are the top rated antivirus software available?"
            ],
            "responses": [
                  "Bitdefender, Kaspersky, Webroot, and NortonLifeLock"
            ]
      },
      {
            "tag": 191,
            "patterns": [
                  "How do I make a strong password?"
            ],
            "responses": [
                  "1) make the password at least 12 characters long\n2) include a combination of letters, numbers, and symbols\n3) don't use accented characters"
            ]
      },
      {
            "tag": 192,
            "patterns": [
                  "How do I know if someone is spying on my cell phone?"
            ],
            "responses": [
                  "1) check if your phone has been using unusually high amounts of data\n2) see if your phone shows signs of activity in standby mode\n3) if your phone unexpectedly reboots\n4) if you hear odd sounds during phone calls\n5) if you are getting weird or offensive text OR your friends are receiving them from you\n6) your battery life is deteriorating \n7) when your phone is idly standing by and the temperature of your battery is increasing\n8) it takes longer for you phone to shutdown\n9) for phone is running slower and slower"
            ]
      },
      {
            "tag": 193,
            "patterns": [
                  "How do I know if a social media account is fake?"
            ],
            "responses": [
                  "1) Check the updates posted on the profile. Make sure the account is communiicating with other members.\n2) Keep an eye out if the account often sends out spam.\n3) If the profile claims to be a high-profile user check for the social media's verification symbol \n4) Check is the account is made for fake reviews. Signs of such would be if they comment on the brand as a whole \nand not a specific product"
            ]
      },
      {
            "tag": 194,
            "patterns": [
                  "Can malware be installed without my knowledge?"
            ],
            "responses": [
                  "Yes, a common example is when visiting a malicious website where it will use the vulnerabilities of your PC to infect it. It will \ndo this without your knowledge."
            ]
      },
      {
            "tag": 195,
            "patterns": [
                  "How do I know if an email is a phishing attempt?"
            ],
            "responses": [
                  "1) Note that such emails may look like they come from companies you trust\n2) The emails above often try to provide a story that will convince you to click on a link including...\n    - suspicious activity or log in attemps\n    - say there is a problem with yout payment information\n    - say you must conform personal information\n    - include a fake invoice\n    - click on a link to make a payment\n    - say you are eligable for a gonvernment refund\n    - offering a free cupon "
            ]
      },
      {
            "tag": 196,
            "patterns": [
                  "Can someone spy on me through my phone camera?"
            ],
            "responses": [
                  "Yes, you can be spied on through your camera. There are several applications that can be found online that allows \nsomeone to spy on you through your phone."
            ]
      },
      {
            "tag": 197,
            "patterns": [
                  "How do I know when to update my security software?"
            ],
            "responses": [
                  "You should often check you security products account where you will find the option to check for updates in the file or \nhelp menu."
            ]
      },
      {
            "tag": 198,
            "patterns": [
                  "What personal information should I protect?"
            ],
            "responses": [
                  "Low Sensitivity\n     - full name, address, and phone number\nMedium Snesitivity\n     - date of birth, place of birth, mothers maiden name\nHigh Sensitivity\n     - bank account number, social security number, pin numbers, credit/debit card numbers, and passwords"
            ]
      },
      {
            "tag": 199,
            "patterns": [
                  "What are the dangers of using a mobile hotspot?"
            ],
            "responses": [
                  "1) IT admins tend to lose control of what could be streaming over the internet connection\n2) Could expose a user's corprate login credentials"
            ]
      },
      {
            "tag": 200,
            "patterns": [
                  "What are some ways to secure my device while using a mobile hotspot?"
            ],
            "responses": [
                  "1) Enable WPA2 and set a strong passwaord\n2) Use a VPN\n3) Set up guest networks\n4) Make sure device antivirus is up to date\n5) Disallow mobile hotspots on company devices"
            ]
      },
      {
            "tag": 201,
            "patterns": [
                  "What are some ways to shop safe online?"
            ],
            "responses": [
                  "1) Shop with reputable retailers\n2) Vet new-to-you businesses\n3)Beware amazing deals\n4) Don't browze on public Wi-Fi\n5) Use a VPN\n6) Pick a strong Password\n7) Check site security before you buy\n8) Don't fall for email scams\n9) Guard your personal Information\n10) Pay with credit not debit\n11) Add extra secirity with a virtutal credit card\n12)Keep an eye out for fraud\n13) Mind the details\n14) Track you stuff\n15) Report Scammers"
            ]
      },
      {
            "tag": 202,
            "patterns": [
                  "How can I know if an online shop is legit? "
            ],
            "responses": [
                  "1) Check to see if there is contact information \n2) Check the customer feedback on the product or company. It also wouldn't hurt to search the name of the company and\nthe word \"scam\" or \"fake\"\n3) Use Whois. You can type in the webaddress and this website will let you know if the site is registered. \n4) See if the website is using encription measures by looking for \"https://www.\" at the beginning of the webaddress\n5) Use google Safe Browsing\n6) Pay attention to the look and feel of the website, does it look professional?"
            ]
      },
      {
            "tag": 203,
            "patterns": [
                  "Should I let my web browser remember my passwords?"
            ],
            "responses": [
                  "No you should not. It is fairly easy to view passwords on your web browser, therefore it would be quite easy for anyone to view your passwords. "
            ]
      },
      {
            "tag": 204,
            "patterns": [
                  "Should I answer online security questions truthfully?"
            ],
            "responses": [
                  "The Identity Theft Resource Center encourages to use alternative answers as it would be nearly impossible to research or\nguess the answer."
            ]
      },
      {
            "tag": 205,
            "patterns": [
                  "Is online banking safe?"
            ],
            "responses": [
                  "It is safe when secure technology on the back end is met with alert consumers on the front end."
            ]
      },
      {
            "tag": 206,
            "patterns": [
                  "How do I improve my online banking security?"
            ],
            "responses": [
                  "1) Choose an insitution that uses industry-standard security \n2) Skip public Wi-Fi private banking \n3) Keep anti-virus software current\n4) Change passwords regulary\n5) Ask for text alerts when a large transaction has been made"
            ]
      },
      {
            "tag": 207,
            "patterns": [
                  "Should I use my personal phone number for business?"
            ],
            "responses": [
                  "No, your personal information is under constant threat from hackers, scammers, and pranksters; thus, you should not make it easier to gain your information by providing your real phone number for business."
            ]
      },
      {
            "tag": 208,
            "patterns": [
                  "Should I use my credit or debit card when shopping online?"
            ],
            "responses": [
                  "From a legal perspective, credit cards generally provide more protection against fraudulent activity."
            ]
      },
      {
            "tag": 209,
            "patterns": [
                  "Can online ads contain malware?"
            ],
            "responses": [
                  "Yes, clicking on such an ad could install spyware, viruses, trojans or other types of malware on your computer."
            ]
      },
      {
            "tag": 210,
            "patterns": [
                  "What are the most common hacking techniques"
            ],
            "responses": [
                  "Common ways could include:\n1) Fake WAP\n2) Bait and Switch\n3) Credential Reuse\n4) SQL Injection\n5) Browser Locker"
            ]
      },
      {
            "tag": 211,
            "patterns": [
                  "Which countries account for the most hacking traffic?"
            ],
            "responses": [
                  "China, United States of America, Turkey, Russia, Taiwan, Brazil, Rome"
            ]
      },
      {
            "tag": 212,
            "patterns": [
                  "What does it mean when my camera is on, but I'm not using my camera?"
            ],
            "responses": [
                  "If your webcam indicator light is on or it’s acting abnormally (you see a blinking LED) even though you haven’t turned the \nwebcam on, it’s a sign that something might not be right."
            ]
      },
      {
            "tag": 213,
            "patterns": [
                  "Can my smartwatch be hacked?"
            ],
            "responses": [
                  "A smartwatch can be hacked causing API issues. This could lead to a hacker making phone calls, spying on users,\n sending fake messages, and more."
            ]
      },
      {
            "tag": 214,
            "patterns": [
                  "Is it possible for an electronic personal assistant to get hacked?"
            ],
            "responses": [
                  "Similar to other computer programs, the fundamental issue with these digital assistants is that they are vulnerable\n to technical and process failures. Digital assistants can also be hacked remotely, resulting in breaches of users’ privacy."
            ]
      },
      {
            "tag": 215,
            "patterns": [
                  "How do I know if an app is safe?"
            ],
            "responses": [
                  "Read the reviews.\nCheck how long the App has been available. \nCheck the publisher and source – is this app from a trusted brand (reputable games developer or social network?)\nCheck your phone:- find and use it’s malware checker or get a decent one.\nDownload anti-malware. \nRead App Store reviews. \nConsider an app’s permissions. If it wants to access your camera and microphone, but it’s supposed to be helping you clear out your contact list, that should feel like a very strange request that warrants a little extra research.\nDon’t download apps that don’t come recommended. "
            ]
      },
      {
            "tag": 216,
            "patterns": [
                  "How to use emails safely?"
            ],
            "responses": [
                  "1.Don't open emails from someone you don't know or trust.\n2.Avoid sending any sensitive information over email. \n3.Never open an attachment within an email from a company or person you don't know (or that you were not expecting).\n4.Never reply to or click on links inside spam emails.\n5.Use a spam filter.\n6.Use anti-virus software.\n7.Be cautious connecting to open WiFi.\n8.Keep your passwords secure.\n9.Avoid unsolicited bulk mail.\n\n"
            ]
      },
      {
            "tag": 217,
            "patterns": [
                  "How do I install an antivirus on my computer using Windows?"
            ],
            "responses": [
                  "1.\nUnderstand the need for an antivirus program. Windows is the most virus-prone operating system (OS) out of the three major OSes. It has the most users and the weakest built-in security. Antivirus programs will defend your computer from malware that comes through email, flash drives, downloads, websites and more.\n2. \nAcquire an antivirus program. There are several popular free options available that do a good job of protecting the average user. These programs are updated frequently with new virus definitions that recognize the latest threats.[1]\nIf you frequently deal with files or websites that are virus-infected, you may want to opt for more powerful paid protection. Paid antivirus programs are typically available for a yearly subscription fee.\nWhen downloading free or paid antivirus programs, ensure that you are downloading from a trusted source. There are many programs out there that claim to be antivirus/antimalware but instead install malware themselves. Read reviews and download products from companies that have been around for a long time.[2]\nWindows 10 and 8 have Windows Defender, which is a free anti-malware application provided by Microsoft. It's already built-in.\n3. \nInstall the antivirus program. Make sure that no other programs are running while you install the antivirus. You will most likely need to be connected to the internet to download additional files and updates.\nSome free antivirus programs come packaged with toolbars for your web browser. These can add protection but also change your search options and bog down older computers. You have the opportunity to opt out of these changes during the installation process."
            ]
      },
      {
            "tag": 218,
            "patterns": [
                  "How do I know if a website is safe? "
            ],
            "responses": [
                  "Google’s Safe Browsing technology examines billions of URLs per day looking for unsafe websites. Every day, we discover thousands of new unsafe sites, many of which are legitimate websites that have been compromised. When we detect unsafe sites, we show warnings on Google Search and in web browsers. You can search to see whether a website is currently dangerous to visit."
            ]
      },
      {
            "tag": 219,
            "patterns": [
                  "How do I protect my data if I lost my iphone?"
            ],
            "responses": [
                  "1.Look for your device on a map\nTo find your device, sign in to iCloud.com/find. Or use the Find My app on another Apple device that you own.\nIf your iPhone, iPad or iPod touch doesn’t appear in the list of devices, Find My was not turned on. But you can still protect your account if Find My was not turned on.\n2. Mark as Lost\nWhen you mark your device as lost, you lock it remotely with a passcode, keeping your information secure. This also disables Apple Pay on the missing device. And you can display a custom message with your contact information on the missing device. \n\n3.Report your missing device to the police\nThe police might request the serial number of your device. \n\n4.File a Theft and Loss claim\nIf your missing iPhone is covered by AppleCare+ with Theft and Loss, file a claim for an iPhone replacement.\n\n5.Erase your device remotely\nAfter you erase a device, you can't track its location, so make sure you no longer need to search for the device. If you have AppleCare+ with Theft and Loss, do not erase your iPhone until your claim has been approved.\n\n6. Contact your wireless network provider\nIf the missing device is an iPhone or an iPad with cellular, report your missing device to your wireless network provider. Ask the network provider to disable your account to prevent calls, texts and data use. And if your device is covered under your wireless network provider plan, file a claim.\n\n7. Remove your missing device from your account\nIf you have AppleCare+ with Theft and Loss, do not remove your lost iPhone from your account until your claim has been approved."
            ]
      },
      {
            "tag": 220,
            "patterns": [
                  "How do I improve my phone security? "
            ],
            "responses": [
                  "1. Keep Your Phone Locked\n2. Set Secure Passwords\n3. Keep Your Device’s OS Up-To-Date\n4.Connect to Secure Wifi\n5. Beware of Downloads\n6. Don’t Jailbreak or Root Your Phone\n7. Encrypt Your Data\n8. Install Anti-Virus Software"
            ]
      },
      {
            "tag": 221,
            "patterns": [
                  "How I can recover my Google account as it was hacked? "
            ],
            "responses": [
                  "Step 1: Sign in to your Google Account:\nStep 2: Review activity & help secure your hacked Google Account\n\nStep 3: Take more security steps\nTurn on 2-Step Verification\nContact your bank or local authorities\nRemove harmful software\nInstall a more secure browser\nHelp prevent password theft with Password Alert\nHelp secure your apps and devices\nHelp secure other Google products you use\n\n4: Find out if your Google Account has been hacked\nIf you notice any of these signs, someone else may be using your Google Account.\n\nImportant: If you think someone else is signed in to your Google Account, change your password immediately for:\n\nYour Google Account, if you didn’t change it already\nApps and sites:\nThat you use the same password you used for your Google Account\nThat contact you through your Google Account email address\nWhere you sign in with your Google Account email address\nWhere you saved passwords in your Google Account\nYou can then check for and remove any unfamiliar devices signed in to your account.\n\n5. Suspicious account activity\nUnfamiliar changes to critical security settings\nUnauthorized financial activity\nUnusual activity notifications\nSuspicious activity in Google products you use:"
            ]
      },
      {
            "tag": 222,
            "patterns": [
                  "Are cryptocurrency transactions traceable?"
            ],
            "responses": [
                  "Due to the highly secure nature of transactions, purchases cannot be traced."
            ]
      },
      {
            "tag": 223,
            "patterns": [
                  "One way to scan virus files downloaded from the internet?"
            ],
            "responses": [
                  "1. Visit the Virus Total Homepage.\n2. Click on the \"Submit a URL\" tab and enter the address of the website where you are about to download the file from.\n3. Hit the \"Submit URL\" button. Virus Scan will check the website for viruses and let you know whether it is safe for downloading files from there or not."
            ]
      },
      {
            "tag": 224,
            "patterns": [
                  "How to set up apple pay?"
            ],
            "responses": [
                  "Go to Wallet and tap the add button.\nFollow the steps to add a new card. Watch the demo to see how it works. If you're asked to add the card that you use with your Apple ID, cards on other devices, or cards that you’ve recently removed, choose them, then enter the card security codes. You might be required to download an app from your bank or card issuer to add a card to Wallet. In China mainland, you might be required to create or update a 6-digit passcode.\nTap Next. Your bank or card issuer will verify your information and decide if you can use your card with Apple Pay. If your bank or issuer needs more information to verify your card, they'll ask you for it. When you have the information, go back to Wallet and tap your card.\nAfter your bank or issuer verifies your card, tap Next. Then start using Apple Pay."
            ]
      },
      {
            "tag": 225,
            "patterns": [
                  "How to block anonymous number from calling ifor iphone? "
            ],
            "responses": [
                  "1. Detect and block spam phone calls\nYou can use Silence Unknown Callers or a third-party app to block spam calls on your iPhone.\n\n2. Turn on Silence Unknown Callers\nWith iOS 13 and later, you can turn on Silence Unknown Callers to avoid getting calls from people you don’t know. This blocks phone numbers that you've never been in contact with and don’t have saved in your contacts list. If you’ve previously texted with someone using their phone number or if a person has shared their phone number with you in an email, a phone call from that number will go through.\nTo turn on Silence Unknown Callers, go to Settings > Phone, then scroll down, tap Silence Unknown Callers, and turn on the feature. Calls from unknown numbers are silenced and sent to your voicemail, and appear in your recent calls list.\nIncoming calls will come through from people that are saved in your contacts list, recent calls list, and from Siri Suggestions to let you know who’s calling based on phone numbers included in your emails or text messages.\nIf an emergency call is placed, Silence Unknown Callers will be temporarily disabled for the next 24 hours to allow for your iPhone to be reached.\nBefore you turn on Silence Unknown Callers, make sure you have important contacts saved or you could miss a phone call that you don’t want to miss. The call will still go to voicemail and appear in your recent calls list, but you won’t get a notification while the call is ringing.\n\n3. Set up an app to filter and detect spam calls\nGo to the App Store and download an app that detects and blocks spam phone calls. You can download and install multiple apps with this feature from different app developers.\nGo to Settings > Phone.\nTap Call Blocking & Identification.\nUnder Allow These Apps To Block Calls And Provide Caller ID, turn the app on or off. You can also reorder the apps based on priority. Just tap Edit and then drag the apps in the order you want them.\n\nPhone numbers that appear under Blocked Contacts are numbers that you manually block."
            ]
      },
      {
            "tag": 226,
            "patterns": [
                  "What should I do if my computer got virus?"
            ],
            "responses": [
                  "1. Removing a computer virus from a PC\nComputer viruses are almost always invisible. Without anti-virus protection, you may not know you have one. This is why it is vital to install anti-virus protection on all your devices.\nIf your PC has a virus, following these ten simple steps will help you to get rid of it:\nStep 1: Download and install a virus scanner\nStep 2: Disconnect from internet\nStep 3: Reboot your computer into safe mode\nStep 4: Delete any temporary files\nStep 5: Run a virus scan\nStep 6: Delete or quarantine the virus\nStep 7: Reboot your computer\nStep 8: Change all your passwords\nStep 9: Update your software, browser and operating system"
            ]
      },
      {
            "tag": 227,
            "patterns": [
                  "How to scan virus from emails as an attachment?"
            ],
            "responses": [
                  "1. Anti-virus scanning attachments\nAttachments in Gmail messages you send and receive are automatically scanned for viruses.\n2. What happens when viruses are found\nVirus in an email you're sending\nIf an attachment you're trying to attach is infected with a virus, you'll see a \"Virus detected!\" error message. You'll see the option to send the email without the attachment.\n3.Virus in an email sent to you\nWhen Gmail finds a known virus attached to an email that's been sent to you, Gmail will reject the message and let the sender know.\nIf Gmail finds a virus in an attachment on an email that's already in your inbox, you won't be able to download the attachment. \n4.\"Gmail virus scanners are temporarily unavailable\" error\nYou might get this error if Gmail can't scan certain files at the moment. Try downloading the attachment later, or you can open the attachment at your own risk.\n"
            ]
      },
      {
            "tag": 228,
            "patterns": [
                  "How to prevent scam from internet banking?"
            ],
            "responses": [
                  "Keep your computers and mobile devices up to date. Having the latest security software, web browser, and operating system are the best defenses against viruses, malware, and other online threats. Turn on automatic updates so you receive the newest fixes as they become available.\nSet strong passwords. A strong password is at least eight characters in length and includes a mix of upper and lowercase letters, numbers, and special characters.\nWatch out for phishing scams. Phishing scams use fraudulent emails and websites to trick users into disclosing private account or login information. Do not click on links or open any attachments or pop-up screens from sources you are not familiar with. Forward phishing emails to the Federal Trade Commission (FTC) at spam@uce.gov – and to the company, bank, or organization impersonated in the email.\nKeep personal information personal. Hackers can use social media profiles to figure out your passwords and answer those security questions in the password reset tools. Lock down your privacy settings and avoid posting things like birthdays, addresses, mother’s maiden name, etc. Be wary of requests to connect from people you do not know.\nSecure your internet connection. Always protect your home wireless network with a password. When connecting to public Wi-Fi networks, be cautious about what information you are sending over it.\nShop safely. Before shopping online, make sure the website uses secure technology. When you are at the checkout screen, verify that the web address begins with https. Also, check to see if a tiny locked padlock symbol appears on the page.\nRead the site’s privacy policies. Though long and complex, privacy policies tell you how the site protects the personal information it collects. If you don’t see or understand a site’s privacy policy, consider doing business elsewhere.\n"
            ]
      },
      {
            "tag": 229,
            "patterns": [
                  "How to prevent PC getting virus from USB?"
            ],
            "responses": [
                  "Use an encrypted USB drive\nPut the USB flash drive in read-only mode using the physical switch to avoid virus transmission: some USB flash drives include a physical switch to put the drive in a read-only mode to avoid the host computer from writing or modifying the data on the drive\nScan USB flash drive after copying files from an untrusted and/or unauthorised machine to avoid virus transmission\nBefore plugging your USB drive into someone else’s computer, delete all files which are not relevant for the purpose of that action\nBackup information in your USB to recover data in case of a disaster\nAttach USB drives to key chains/lanyards to avoid loss of media: the reduced size of USB flash drives makes these devices easier to lose or be stolen. Furthermore, the higher storage capacity increases the potential amount of data at risk for unauthorised access. USB flash drives are usually put in bags, backpacks, laptop cases, jackets, trouser pockets or are left on unattended workstations. The number of incidents has increased recently as USB drives get lost, misplaced, borrowed without permission or stolen"
            ]
      },
      {
            "tag": 230,
            "patterns": [
                  "How to prevent USB from virus attack?"
            ],
            "responses": [
                  "Keep personal and work-related USB sticks separately\nIf you don’t know where the USB drive is coming from, don’t use it\nOccasionally change and update your USB keys\nRegularly scan your USB drives and devices with an antivirus\nDisable autorun features on all your devices (this will prevent any unknown files from launching without you knowing or giving permission)\nIf you really need to get information from an unknown USB source, plug it into some sort of buffer device and scan it for malware\nIf you have already plugged a suspicious USB drive in, immediately disconnect from the internet to prevent any downloads and restart your device\nOr avoid using USB sticks at all times! Just kidding. Get quality antivirus software instead."
            ]
      },
      {
            "tag": 231,
            "patterns": [
                  "How to block a social media account? "
            ],
            "responses": [
                  "Log into your profile on mobile or desktop.\nGo to the profile of the person you are trying to block.\nClick on the ellipsis in the right-hand corner of their profile.\nSelect “block” from the top of the list.\nConfirm you would like to block this person."
            ]
      },
      {
            "tag": 232,
            "patterns": [
                  "How to delete your camera’s video history and snapshots automatically?"
            ],
            "responses": [
                  "Your video history and snapshots are automatically deleted during normal use. Here’s how:\nRolling video history - Depending on which Nest Aware subscription you have, your camera’s older footage and snapshots automatically expire and are deleted after a certain number of days.\nIf you don’t have a subscription, you’ll still get snapshots up to 3 hours in the past, which will also automatically expire and be deleted after 3 hours.\nRemoving a camera from the Nest app or cancelling a subscription. If you cancel a subscription, your video history will be deleted as follows: \nNest Aware video history will be deleted at the end of your last billing period or if you remove all cameras from your account.\n1st gen Nest Aware video history and snapshots are erased when you remove a camera from your account or you cancel your subscription."
            ]
      },
      {
            "tag": 233,
            "patterns": [
                  "How to check your webcam if it has been hacked? "
            ],
            "responses": [
                  "1. Check the Webcam Indicator Light\n2. Check Your Storage Files\n3. Check for Unknown Applications\n4. Run a Malware Scan\n5. Observe the Camera Behaving Abnormally\n6. Check the Webcam Security Settings\n7. Check the Data Flow"
            ]
      },
      {
            "tag": 234,
            "patterns": [
                  "How to stop phones listening and target ads on iphone? "
            ],
            "responses": [
                  "iPhone\nTo stop apps from using your microphone:\n\nGo to Settings > Privacy > Microphone\nCheck which apps have microphone access and remove them as you wish.\nTo turn off Siri \n\nGot to Settings > Siri & Search\nDeselect Listen for “Hey Siri,” Press Home for Siri, and Allow Siri When Locked\nA prompt should appear asking if you want to turn off Siri; press Turn Off Siri.\n\n\nGot to Settings > General > Siri\nSelect Turn Off Siri\nTo turn off dictation:\n\nGo to Settings > General > Keyboard\nDeselect Enable Dictation"
            ]
      },
      {
            "tag": 235,
            "patterns": [
                  "How to prevent cell phone interception?"
            ],
            "responses": [
                  "Step 1: Check your cell phone bill. If it shows an unusually high number of text messaging or data usage, you may have a spy.\nStep 2: Keep an eye on your phone. If it lights up at random times, even if you aren't using it, that could indicate that someone is checking your position or listening in on your conversations. In addition, if you have a hard time shutting down the phone, or it stays lit up even though it is supposedly powered down, someone else may be using it.\nStep 3: Listen to your phone. When you are on the phone, listen for unusual beeps and clicks or a fuzzy ambient noise.\nStep 4: Feel your phone's battery. If it is warm even though the phone hasn't been in use, it's possible that the phone has been in use, only not by you."
            ]
      },
      {
            "tag": 236,
            "patterns": [
                  "How to prevent my computer from getting virus? "
            ],
            "responses": [
                  "Use anti-virus software or a complete internet security solution, like Kaspersky Total Security. For your Android mobile, consider Kaspersky Internet Security for Android.\nResearch apps and software by reading user reviews.\nRead developer descriptions before you download apps and software.\nOnly download apps and software from trusted sites.\nCheck how many downloads apps and software have. The more, the better.\nCheck what permissions apps and software ask for. Are these reasonable?\nNever click on unverified links in spam emails, messages or unfamiliar websites.\nDo not open attachments in spam emails.\nKeep software, apps and your operating system updated.\nUse a secure VPN connection for public Wi-Fi, like Kaspersky Secure Connection.\nNever insert unknown USB sticks or disks into your computer."
            ]
      },
      {
            "tag": 237,
            "patterns": [
                  "What is SSL?"
            ],
            "responses": [
                  "SSL, or Secure Sockets Layer, is software that helps create encryptions between a web server and a web browser in order to help secure online transactions and payments."
            ]
      },
      {
            "tag": 238,
            "patterns": [
                  "Is cryptocurrency secure?"
            ],
            "responses": [
                  "Cryptocurrency got its name because it uses encryption to verify transactions. This means advanced coding is involved in storing and transmitting cryptocurrency data between wallets and to public ledgers. The aim of the encryption is to provide security and safety."
            ]
      },
      {
            "tag": 239,
            "patterns": [
                  "What is IDS and IPS?"
            ],
            "responses": [
                  "The IDS (intrusion detection system) detects and breach/intrusions, while IPS (intrusion prevention system) finds and prevents breaches."
            ]
      },
      {
            "tag": 240,
            "patterns": [
                  "How can one fortify email and instant messaging?"
            ],
            "responses": [
                  "Immediately delete messages you suspect are spam, don't open email or text messages from unknown senders, use anti-virus protection and a firewall, only download software from sites you trust, and increase your browser security settings."
            ]
      },
      {
            "tag": 241,
            "patterns": [
                  "What is malware?"
            ],
            "responses": [
                  "Designed to infiltrate or damage a computer system, Malware is malicious software that destroys systems without the owner's consent."
            ]
      },
      {
            "tag": 242,
            "patterns": [
                  "How can I remove malware?"
            ],
            "responses": [
                  "First, check how infected the computer system is using a scan program. Then, find an anti-malware software from a reputable company according to infection levels."
            ]
      },
      {
            "tag": 243,
            "patterns": [
                  "How can I prevent malware?"
            ],
            "responses": [
                  "Use the Mozilla Firefox browser, use public or multiple-user computers with extreme caution, use a good anti-spyware product and update your security patches regularly."
            ]
      },
      {
            "tag": 244,
            "patterns": [
                  "How do prevent popups and their damage?"
            ],
            "responses": [
                  "Avoid clicking on pop-ups, and close pop-ups from the system tray area with a right mouse click. Use anti-virus protection and a firewall, update your operating system regularly, increase your browser security settings and get anti-spyware software protection. "
            ]
      },
      {
            "tag": 245,
            "patterns": [
                  "what is phishing?"
            ],
            "responses": [
                  "Phishing is the act of online surveys, websites, pop-ups and other avenues to trick the user into diulging sensiitive information such as credit card numbers or passwords."
            ]
      },
      {
            "tag": 246,
            "patterns": [
                  "how do you prevent phishing?"
            ],
            "responses": [
                  "Only provide personal information on sites that have \"https\" in the web address or have a lock icon at bottom of the browser, use unique and varied passwords, use anti-virus protection and a firewall, and get anti-spyware software protection. Contact any company directly and verify that it is safe to divulge information if you suspect phishing."
            ]
      },
      {
            "tag": 247,
            "patterns": [
                  "what are the symptoms of an adware infection?"
            ],
            "responses": [
                  "Slower PC, more pop-ups, pop-under or banner ads, frequent computer crashes, and puzzling search results."
            ]
      },
      {
            "tag": 248,
            "patterns": [
                  "how can i prevent hijacked home pages?"
            ],
            "responses": [
                  "Use anti-virus protection and a firewall, update your operating system regularly, increase your browser security settings and get anti-spyware software protection. Avoid file-sharing applications."
            ]
      },
      {
            "tag": 249,
            "patterns": [
                  "how do you fortify internet security?"
            ],
            "responses": [
                  "Only download software from sites you trust, pay careful attention to what you’re downloading and know what other programs you’ve agreed to along with the original file, use anti-virus protection and a firewall, update your operating system regularly, increase your browser security settings and get anti-spyware software protection. "
            ]
      },
      {
            "tag": 250,
            "patterns": [
                  "how can one practice safe file sharing?"
            ],
            "responses": [
                  "Even though there are reputable sites offering safe files, it’s difficult to investigate every free program to distinguish between the good and bad. This is why it is important to fortify computer security."
            ]
      },
      {
            "tag": 251,
            "patterns": [
                  "how does adware find a user?"
            ],
            "responses": [
                  "It is commonly found attached to an intentionally installed program. Peer-to-peer groups attach adware to their file sharing programs. Sharing your information with interested companies is an easy way for developers to make money. "
            ]
      },
      {
            "tag": 252,
            "patterns": [
                  "What are some examples of freeware that may deliver adware?"
            ],
            "responses": [
                  "Some examples are unusual mouse pointers, instant news or weather updates, computer games, applications boasting to improve the efficiency of your computer, and file sharing resources for digital photos or music."
            ]
      },
      {
            "tag": 253,
            "patterns": [
                  "How does a firewall work?"
            ],
            "responses": [
                  "Firewalls are like filters between a secure internal network and external netwprks that could be non-secure. this filter can be adjusted."
            ]
      },
      {
            "tag": 254,
            "patterns": [
                  "what are the two different methods that can be used to identify and eliminate malware?"
            ],
            "responses": [
                  "Virus dictionary approach and the Suspicious behavior approach."
            ]
      },
      {
            "tag": 255,
            "patterns": [
                  "How does the virus dictionary approach work?"
            ],
            "responses": [
                  "The software scans the virus and compares it to previously recorded viruses. If it matches, then the file is deleted, quarantined, or repaired. "
            ]
      },
      {
            "tag": 256,
            "patterns": [
                  "How does the suspicious behavior approach work?"
            ],
            "responses": [
                  "The software monitors and flags suspicious behavior. The user is then made aware, and prompted on how to approach the flagged threats."
            ]
      },
      {
            "tag": 257,
            "patterns": [
                  "What is data encryption?"
            ],
            "responses": [
                  "When data is converted into another form or code that can only be accessed with a secret key or password, it is called data encryption."
            ]
      },
      {
            "tag": 258,
            "patterns": [
                  "What are the types of data encryption?"
            ],
            "responses": [
                  "asymmetric encription (or public-key encryption) and symmetric encription."
            ]
      },
      {
            "tag": 259,
            "patterns": [
                  "How does asymmetric encription work?"
            ],
            "responses": [
                  "Asymmetric encription typically uses two different keys, a public and a private one. The public key is shared with everyone, but the private key is secret."
            ]
      },
      {
            "tag": 260,
            "patterns": [
                  "How does symmetric encription work?"
            ],
            "responses": [
                  "Symmetric encription typically uses one key, used in both encrypting and decrypting the file. While it is faster than asymmetric, it requires that the sender share the encryption key with the recipient."
            ]
      },
      {
            "tag": 261,
            "patterns": [
                  "What is a major weakpoint that can be easily exploited by cyber criminals?"
            ],
            "responses": [
                  "The biggest weakpoint is human error. This is why users have to be educated in computer security."
            ]
      },
      {
            "tag": 262,
            "patterns": [
                  "What is DDoS?"
            ],
            "responses": [
                  "DDoS, or Denial of Service, is a type of cyber attack used to restrict the users access to system resources. This is done by flooding the server with traffic."
            ]
      },
      {
            "tag": 263,
            "patterns": [
                  "What is eavesdropping in terms of computer security?"
            ],
            "responses": [
                  "When an attacker monitors a users activity, it is called eavesdropping. This can be done though items downloaded, emails and websites visited."
            ]
      },
      {
            "tag": 264,
            "patterns": [
                  "How do I know how secure a website is?"
            ],
            "responses": [
                  "1. In Chrome, open a page.\n2. To check a site's security, to the left of the web address, look at the security status:\nLock Secure\nView site information Info or Not secure\nDangerous Not secure or Dangerous\n3. To see the site's details and permissions, select the icon. You'll see a summary of how private Chrome thinks the connection is."
            ]
      },
      {
            "tag": 265,
            "patterns": [
                  "How can I tell if my connection is secure?"
            ],
            "responses": [
                  "You can tell if a website is using HTTPS by looking at the URL. The URL should start with \"HTTPS\" if it is encrypted."
            ]
      },
      {
            "tag": 266,
            "patterns": [
                  "How do I know if my VPN is actually encrypted?"
            ],
            "responses": [
                  "You should check your IP address through visiting whatismyipaddress.com. If you get information which is similar to your real IP address and location, then your VPN connection probably contains vulnerabilities."
            ]
      },
      {
            "tag": 267,
            "patterns": [
                  "How do I hide traffic on my network?"
            ],
            "responses": [
                  "Ensure that your Wi-Fi network is protected with a password so that unauthorized users cannot gain access. To ensure that your browsing history is private, use a VPN."
            ]
      },
      {
            "tag": 268,
            "patterns": [
                  "How do I find out my IP address?"
            ],
            "responses": [
                  "Using a site like https://whatismyipaddress.com/ you can find your publicly accessible IP address."
            ]
      },
      {
            "tag": 269,
            "patterns": [
                  "How do I know if my computer's security has been compromised?"
            ],
            "responses": [
                  "Run antivirus software. To learn how to install antivirus software, ask \"How do I install antivirus software?\""
            ]
      },
      {
            "tag": 270,
            "patterns": [
                  "How can I tell if a business is legitimate?"
            ],
            "responses": [
                  "Check the Better Business Bureau at https://www.bbb.org/ to see reviews and complaints for businesses before revealing credit card information or personal information."
            ]
      },
      {
            "tag": 271,
            "patterns": [
                  "Should I install software from an unknown location?"
            ],
            "responses": [
                  "If you have antivirus software enabled, the software should be scanned automatically. If there are any issues found, delete the program and run your antivirus software to remove any malware that may have infected your computer. For more information, ask \"How do I remove a virus from my computer?\""
            ]
      },
      {
            "tag": 272,
            "patterns": [
                  "How do I know if an email is safe to open?"
            ],
            "responses": [
                  "Check the sender and make sure that you know who sent the email. If you do not trust the source of the email, do not open any attachments or click on any links. For more information on how to determine if an email is safe to open, visit https://www.cose.org/en/Mind-Your-Business/Operations/Is-This-Email-OK-to-Open-9-Warning-Signs-to-Watch."
            ]
      },
      {
            "tag": 273,
            "patterns": [
                  "What file extensions could indicate a virus?"
            ],
            "responses": [
                  "Never run files with any type of executable extension on it, or at least use extreme caution. These file types can contain malware and viruses in their coding. Watch for the following file extensions: .ade  .adp  .asf  .bas  .bat  .chm  .cmd  .com  .cpl  .crt  .exe  .hlp  .hta  .inf  .ins  .isp  .jar  .js  .jse  .lnk  .mdb  .mde  .mov  .msc  .msi  .msp  .mst  .pcd  .pif  .psc1  .reg  .scr  .sct  .shs  .swf  .url  .vb  .vbe  .vbs  .wsc  .wsf  .wsh"
            ]
      },
      {
            "tag": 274,
            "patterns": [
                  "Is it safe to use public Wi-Fi?"
            ],
            "responses": [
                  "Exercise caution when using public Wi-Fi. Most network traffic is encrypted, but to be safe, refrain from making bank transactions or using accessing any confidential information on public networks. If this is unavoidable, you can take steps to secure your device by doing the following: enable two-factor authentication, use a VPN, and encrypt your device."
            ]
      },
      {
            "tag": 275,
            "patterns": [
                  "Are all websites encrypted?"
            ],
            "responses": [
                  "A recent study by researchers in Italy and Austria found that about 5.5 percent of the top 10,000 websites secured by HTTPS had TLS security flaws that could make them vulnerable to man-in-the-middle attacks or allow an attacker to at least partly decrypt them."
            ]
      },
      {
            "tag": 276,
            "patterns": [
                  "How do I check my current antivirus software?"
            ],
            "responses": [
                  "Select Start > Settings > Update & Security > Windows Security and then Virus & threat protection. Open Windows Security settings.\nApple:\nMac computers have built-in antivirus and malware scanning software."
            ]
      },
      {
            "tag": 277,
            "patterns": [
                  "How do I update my operating system?"
            ],
            "responses": [
                  "Select Start > Settings > Update & Security > Windows Update.\nApple:\nChoose System Preferences from the Apple menu, then click Software Update to check for updates."
            ]
      },
      {
            "tag": 278,
            "patterns": [
                  "Are apps downloaded from an official app store safe?"
            ],
            "responses": [
                  "Microsoft verifies that apps in the store are safe and adhere to privacy, content, and security standards.\nApple:\nApple provides layers of protection to help ensure that apps are free of known malware and haven’t been tampered with."
            ]
      },
      {
            "tag": 279,
            "patterns": [
                  "Is my data really gone when I delete it?"
            ],
            "responses": [
                  "A deleted file still exists on the hard drive and could easily be retrieved with recovery software. So, just because you can’t see a file in the directory after it’s been deleted doesn’t mean that it’s not there. This is a security issue most computer users do not take seriously until it’s too late. To permanently delete your data, use eraser software or data shredding software."
            ]
      },
      {
            "tag": 280,
            "patterns": [
                  "When should I wipe my hard drive?"
            ],
            "responses": [
                  "If you are doing the any of the following: selling a computer, recycling a computer, giving a computer away, donating a computer, or cleaning out unnecessary files"
            ]
      },
      {
            "tag": 281,
            "patterns": [
                  "What do I do to delete my data permanently before returning a computer?"
            ],
            "responses": [
                  "1. Back up the data you wish to keep\n2. Use data shredding software to clear your computer\n3. Perform a factory reset"
            ]
      },
      {
            "tag": 282,
            "patterns": [
                  "How do I factory reset my device?"
            ],
            "responses": [
                  "Click the Start menu and select the gear icon in the lower left to open up the Settings window. You can also select the Settings app from the app list. Under Settings, click Update & Security > Recovery, then select Get started under Reset this PC.\nApple:\n1. Restart your computer: hold the power button > select Restart when it appears 2. While the computer restarts, hold down the ‘Command‘ and ‘R‘ keys 3. Once you see the Apple logo appear, release the ‘Command and R keys’ 4. When you see a Recovery Mode menu, select Disk Utility 5. Make sure the ‘Macintosh HD’ startup disk is highlighted in your Disk Utility window > select Erase 6. A pop-up window should appear. Change the Format to macOS Extended (Journaled) > select Erase again 7. Select Quit Disk Utility in the Disk Utilities menu. 8. A window will then appear giving you the option to reinstall macOS > select Install macOS 9. After the new macOS is installed, your computer has been successfully factory reset"
            ]
      },
      {
            "tag": 283,
            "patterns": [
                  "How can I kick unauthorized users off of my accounts?"
            ],
            "responses": [
                  "Change your password to an application or website to forcefully sign out unauthorized users."
            ]
      },
      {
            "tag": 284,
            "patterns": [
                  "Is Bluetooth secure?"
            ],
            "responses": [
                  "Like most technology, bluetooth has security vulnerabilities. However, these vulnerabilities are closely monitored and fixed when they arise. Be cautious and do not connect to unknown devices."
            ]
      },
      {
            "tag": 285,
            "patterns": [
                  "How do I secure app accounts?"
            ],
            "responses": [
                  "Enable two-factor authentication, use strong passwords, and enable security questions/checks. In addition, change your password regularly to make your accounts more secure."
            ]
      },
      {
            "tag": 286,
            "patterns": [
                  "How do I remove a keylogger?"
            ],
            "responses": [
                  "The best method of detecting and removing a keylogger is by using a combination of a strong anti-keylogger and anti-rootkit software that can find and eliminate keyloggers than your antivirus or antimalware utility."
            ]
      },
      {
            "tag": 287,
            "patterns": [
                  "Can I keep my Wi-Fi default password?"
            ],
            "responses": [
                  "Be sure to change your Wi-Fi network's default password as hackers will check a list of factory-default passwords when trying to break into a system."
            ]
      },
      {
            "tag": 288,
            "patterns": [
                  "Do I need to update my device?"
            ],
            "responses": [
                  "Device updates, as long as they are from an official source, should be done regularly as they patch security issues and remove problematic bugs."
            ]
      },
      {
            "tag": 289,
            "patterns": [
                  "Do I need to update my antivirus software?"
            ],
            "responses": [
                  "Update your antivirus software as often as possible. When new bugs are found, antivirus software definitions are updated which provides greater security protection."
            ]
      },
      {
            "tag": 290,
            "patterns": [
                  "How do I increase the strength of my internet connection?”"
            ],
            "responses": [
                  "Here are a few things you can do to increase the strength of internet connection:\n1) Reset your router \n2) Use an Ethernet Cable\n3) Purchase a new router\n4) Add a WI-FI extender. "
            ]
      },
      {
            "tag": 291,
            "patterns": [
                  "How do I reset my router?"
            ],
            "responses": [
                  "To reset your router:\n\nLocate the Reset button on the back of your router        \n\nWith the router powered on, use the pointed end of a paperclip or similar object to press and hold the Reset button for 15 seconds \n       \nWait for the router to fully reset and power back on        "
            ]
      },
      {
            "tag": 292,
            "patterns": [
                  "How do I get rid of a virus on my network?"
            ],
            "responses": [
                  "1. Run a complete network scan to check for malicous files or programs. Make sure that antivirus and anti-malware software scan are up to date.  2. Back up all your system files using the necessary tools. 3. Confine all suspicious, irregular files. Isolating them will prevent their exchange with other files. Then disinfect or completely wipe all files. "
            ]
      },
      {
            "tag": 293,
            "patterns": [
                  "My wifi isn't working"
            ],
            "responses": [
                  "Reboot your router. Turn your router off. Disconnect it from power for at least 30 seconds. Then, plug it back in and turn it on. If rebooting your router did not work, try rebooting your Mac. Power off your Mac, then power back on and try reconnecting. If this is unsuccessful, try forgetting your current network.\nOn a Mac, go to System>Preferences > Network. Select Wifi and then Advanced. Press (-) and select Remove. Try connecting to the network and entering the network password again."
            ]
      },
      {
            "tag": 294,
            "patterns": [
                  "What do I do when an error says my IP address is duplicated/already in use?"
            ],
            "responses": [
                  "On a Mac, select \"System Preferences.\" Then click on \"Network\" and select \"Wi-Fi\" on the left side of the window. Then click on \"Advanced.\" Select the \"TCP/IP\" tab and then click \"Renew DHCP Lease\" on the right side of the window."
            ]
      },
      {
            "tag": 295,
            "patterns": [
                  "How do I connect to devices through Bluetooth?"
            ],
            "responses": [
                  "On a Mac, select \"System Preferences.\" Then select \"Bluetooth.\" Follow the external device's connection instructions. Then, the device should appear under the list of devices. Select the device."
            ]
      },
      {
            "tag": 296,
            "patterns": [
                  "How do I check my PC hardware specifications?"
            ],
            "responses": [
                  "To check your PC hardware specs, click on the Windows Start button, then click on Settings (the gear icon). In the Settings menu, click on System. Scroll down and click on About. On this screen, you should see specs for your processor, Memory (RAM), and other system info, including Windows version."
            ]
      },
      {
            "tag": 297,
            "patterns": [
                  "How to setup new airpods?"
            ],
            "responses": [
                  "To connect AirPods to a PC, put your AirPods in the case and press and hold the small button on the back until the status light starts blinking white. Your AirPods should then show up in the \"Add a device\" window in your PC's Bluetooth settings, where you can click to pair and connect.  \nHere's a full step-by-step breakdown with pictures. \n1. Put your AirPods in their case and make sure they are charged.\n2. Open Settings on your PC from the Start menu. It's the gear-shaped icon above the power button. You can also type \"Settings\" in the Start menu search box.\n3. Click \"Devices.\"\n4. At the top of the \"Bluetooth & other devices\" section, make sure Bluetooth is turned on. The switch should be slid to the right and colored blue.\n5. Click \"Add Bluetooth or other device.\" \n6. In the Add a device window, click \"Bluetooth.\"\n7. Open the lid of your AirPods case.\n8. Press and hold the small button on the back of the case for several seconds, until the status light on the front of the case starts blinking white. \n9. The AirPods should appear in the list of devices available for pairing on your PC. They might first appear as \"Headphones,\" and then change to \"AirPods\" after a few moments. \n10. Click \"AirPods.\"\n11. Windows will connect to the AirPods and display a success message. Click \"Done.\" You can now listen to your PC audio through the AirPods. \n\n\n\n\n"
            ]
      },
      {
            "tag": 298,
            "patterns": [
                  "How to setup a wireless mouse?"
            ],
            "responses": [
                  "Slide off the battery cover in the bottom of the mouse and push the batteries into your wireless device. Some mice are rechargeable. If yours is, place it in the docking station provided with the mouse to charge it.\nPurchase a wireless adapter that is compatible with the type of mouse you own. Plug the adapter into the USB port on the computer and press the \"Power\" button to activate it. Within a few seconds of activating the adapter, push the pinhole on the bottom of the wireless mouse with a pencil or pen to activate it. Some receivers plug into the mouse port and come with an adapter. If your computer is equipped with wireless technology, you will not need an adapter and move on to the next step.\nInstall the driver software that was provided with the mouse. Reboot the computer so it will recognize the software. Turn on the mouse and allow the computer to recognize the device. Some mice require software to run. Activate the mouse in the software that was provided with the device."
            ]
      },
      {
            "tag": 299,
            "patterns": [
                  "How to setup a wireless keyboard"
            ],
            "responses": [
                  "Put the battery in your wireless keyboard. Make sure you install it correctly. You can skip this step if there is built-in battery in your wireless keyboard. Usually the wireless keyboard comes with a unifying receiver. You need to insert the unifying receiver into the USB port on your PC. Turn on your wireless keyboard. the On / Off switch usually can be found on the back or the side of your keyboard.\nOnce you turn on your wireless keyboard, it will start to pair with your PC. If you see any prompted dialog on your computer, just confirm and allow to connect. It may take a while. Wait until your wireless keyboard pair successfully with your PC. \nYou need to test your wireless keyboard when it is connected to your computer. You can open Word or any other word-processing applications and try pressing the keys on your wireless keyboard to see if your wireless keyboard works on your computer.\nIf your wireless keyboard won’t type or it fails to connect to your computer, you can check the troubleshooting steps below:\n1. Check if your wireless keyboard runs out of battery.\n2. Unplug and re-plug the battery and receiver and try connecting your keyboard again.\n3. Update your wireless keyboard driver"
            ]
      },
      {
            "tag": 300,
            "patterns": [
                  "How do I take a screenshot?",
                  "How do I print screen?"
            ],
            "responses": [
                  "To capture your entire screen, tap the Print Screen (sometimes labeled PrtScn) key. Your screenshot will not be saved as a file, but it will be copied to the clipboard. You'll need to open an image editing tool (such as Microsoft Paint), paste the screenshot in the editor and save the file from there. \nYou can also set the PrtScn button to open the Snip & Sketch tool by going to Settings > Ease of Access > Keyboard and toggling on Use the PrtScn button to open screen snipping under Print Screen Shortcut. "
            ]
      },
      {
            "tag": 301,
            "patterns": [
                  "How do I change my keyboard language?"
            ],
            "responses": [
                  "1. Press the Windows key and the letter I (  + I )\n2. Click Time & language icon\n3. Click Region and Language on the left list\n4. Click Add a language\n5. Choose the language that you want to add\n\nSwitch between different input languages. If you've added more than one language to your PC you can switch between different input languages by using one of the following methods:\nMethod 1: Click the language abbreviation button on the taskbar (bottom right corner of your screen, next to the clock) and then click the input method you want to switch to.\nMethod 2: Press and hold the Windows logo key  and then press the Spacebar repeatedly.\n"
            ]
      },
      {
            "tag": 302,
            "patterns": [
                  "How do I connect my headphones?",
                  "My earphones are not working"
            ],
            "responses": [
                  "Method 1:\n\nRun Hardware troubleshooter and checks for common issues and makes sure that any new device or hardware attached to your computer was installed correctly. Follow the below steps:\n1. Press Windows + X keys on the keyboard and select Control Panel.\n2. Type Troubleshooting in the search bar on the Control Panel.\n3. Click on Hardware and sound under Troubleshoot computer problems.\n4. Click on Hardware and devices under Devices.\n5. Click on Advanced on the Hardware and devices dialog box and click on Run as administrator (Enter the credentials if required).\n6. Click on Next and follow onscreen instruction complete the Hardware and devices troubleshooter.\n7. If the issue still persist try the below method.\n\nMethod 2:\n\nMake sure that the headphone that you are using are set as default in the computer. Follow these steps to check this: \n1. Right click on the volume icon and select “Playback devices”.\n 2. Now, right click on empty space and select, “Show disconnected devices” and “Show disabled devices”.\n 3. Select “headphone” and click on “Properties” and make sure that the headphone is enabled & set as default. \n 4. Reconnect your headphones and check if issue is resolved.\n"
            ]
      },
      {
            "tag": 303,
            "patterns": [
                  "How do I adjust screen's brightness?"
            ],
            "responses": [
                  "On Windows 10, you can find a quick brightness slider in the Action Center. To access it, click or tap the notification bubble icon that appears to the right of the clock on the taskbar. If you don’t see the slider, click the “Expand” option above the grid of tiles. Click (or touch) and drag the slider to adjust your screen’s brightness.\n\nOn a touchscreen, you can also swipe in from the right side of your screen to open the Action Center.\n\nYou’ll find this option in the Settings app on Windows 10, too. Open the Settings app from your Start menu or Start screen, select “System,” and select “Display.” Click or tap and drag the “Adjust brightness level” slider to change the brightness level.\n"
            ]
      },
      {
            "tag": 304,
            "patterns": [
                  "How do I use my webcam?",
                  "How to connect USB camera?"
            ],
            "responses": [
                  "Install Your Webcam Software\nBefore you can use your webcam, install its drivers on your computer. Depending on the webcam, it came with either a disk containing the drivers or with instructions to find the drivers online. If your computer doesn't have a disk drive, go to the \"No Disk\" section of this guide.\n\nUse the Provided Disk\nUnless otherwise instructed, insert the disk that came with the webcam before you plug it in. Windows recognizes that you are attempting to install software and starts a wizard to guide you through the process.\nIf the wizard doesn't start automatically, go to the Windows taskbar and select File Explorer (on Windows 10) or My Computer (on older versions of Windows). Or, in the Search box, enter This PC. Then, click the disk drive (usually E:) to install the files on the disk.\n\nNo Disk? No Problem! Plug and Play\nIf the web camera didn't come with a software disk, plug it in and see what happens. Most often, Windows will recognize it as new hardware and can use it. If Windows can't use the webcam, you're guided through the process of searching for drivers (either online or on your computer).\n\nOnce Connected, Browse to Your Webcam Software\nAfter you connect the webcam and position it as desired, turn it on and see what it can do.\nTo use the software that came with the webcam, go to the Start menu and browse to the webcam program, shown here as Logitech Webcam Software. Yours will be associated with the brand and model of your webcam.\nIf you don't like the software that came with your webcam, Windows 10 comes with a Camera app that works well with most brands of webcams.\n\n\n\n\n\n\n\n"
            ]
      },
      {
            "tag": 305,
            "patterns": [
                  "How do I start Safe Mode?"
            ],
            "responses": [
                  "From Settings\n1. Press Windows logo key  + I on your keyboard to open Settings. If that doesn't work, select the Start  button, then select Settings .\n2. Select Update & Security  > Recovery .\n3. Under Advanced startup, select Restart now.\n4. After your PC restarts to the Choose an option screen, select Troubleshoot > Advanced options > Startup Settings > Restart. You may be asked to enter your BitLocker recovery key.\n5. After your PC restarts, you'll see a list of options. Select 4 or press F4 to start your PC in Safe Mode. Or if you'll need to use the Internet, select 5 or press F5 for Safe Mode with Networking.\n\nFrom the sign-in screen\n1.On the Windows sign-in screen, press and hold the Shift key while you select the Power  > Restart .\n2. After your PC restarts to the Choose an option screen, select Troubleshoot > Advanced options > Startup Settings > Restart. You may be asked to enter your BitLocker recovery key.\n3. After your PC restarts, you'll see a list of options. Select 4 or F4 to start your PC in safe mode. Or if you'll need to use the Internet, select 5 or F5 for Safe Mode with Networking.\n\nFrom a black or blank screen\nBefore you enter safe mode, you need to enter the Windows Recovery Environment (winRE). To do this, you will repeatedly turn your device off, then on:\n1. Hold down the power button for 10 seconds to turn off your device.\n2. Press the power button again to turn on your device.\n3. On the first sign that Windows has started (for example, some devices show the manufacturer’s logo when restarting) hold down the power button for 10 seconds to turn off your device.\n4. Press the power button again to turn on your device.\n5. When Windows restarts, hold down the power button for 10 seconds to turn off your device.\n6. Press the power button again to turn on your device.\n7. Allow your device to fully restart. You will enter winRE.\nNow that you are in winRE, you will follow these steps to take you to safe mode:\n1. On the Choose an option screen, select Troubleshoot > Advanced options > Startup Settings > Restart.\n2. After your device restarts, you'll see a list of options. Select option 5 from the list or press F5 for Safe Mode with Networking.\n\n"
            ]
      },
      {
            "tag": 306,
            "patterns": [
                  "How do I refresh my computer?"
            ],
            "responses": [
                  "Refresh your PC to reinstall Windows and keep your personal files and settings. Refresh also keeps the apps that came with your PC and the apps you installed from the Microsoft Store.\n\n1. Swipe in from the right edge of the screen, tap Settings, and then tap Change PC settings.\n(If you're using a mouse, point to the upper-right corner of the screen, move the mouse pointer down, click Settings, and then click Change PC settings.)\n2. Tap or click Update and recovery, and then tap or click Recovery.\n3. Under Refresh your PC without affecting your files, tap or click Get started.\n4. Follow the instructions on the screen.\n\n"
            ]
      },
      {
            "tag": 307,
            "patterns": [
                  "How do I reset my computer?",
                  "How to factory reset?"
            ],
            "responses": [
                  "Reset your PC to reinstall Windows but delete your files, settings, and apps—except for the apps that came with your PC.\n\n1. Swipe in from the right edge of the screen, tap Settings, and then tap Change PC settings.\n(If you're using a mouse, point to the upper-right corner of the screen, move the mouse pointer down, click Settings, and then click Change PC settings.)\n2. Tap or click Update and recovery, and then tap or click Recovery.\n3. Under Remove everything and reinstall Windows, tap or click Get started.\n4. Follow the instructions on the screen."
            ]
      },
      {
            "tag": 308,
            "patterns": [
                  "How do I restore my computer?",
                  "How to undo system changes on PC?"
            ],
            "responses": [
                  "Restore your PC to undo recent system changes you've made.\n\n1. Swipe in from the right edge of the screen, and then tap Search.\n(If you're using a mouse, point to the upper-right corner of the screen, move the mouse pointer down, and then click Search.)\n2. Enter Control Panel in the search box, and tap or click Control Panel.\n3. Enter Recovery in the Control Panel search box, and then tap or click Recovery.\n4. Tap or click Open System Restore, and then follow the instructions.\n\n"
            ]
      },
      {
            "tag": 309,
            "patterns": [
                  "Find out how much remaining storage I have?",
                  "How much disk space left I have?"
            ],
            "responses": [
                  "1. Select the Start button, and then select Settings .\n2. Select System > Storage.\n\n"
            ]
      },
      {
            "tag": 310,
            "patterns": [
                  "How to free up storage space?",
                  "How to clear disk?"
            ],
            "responses": [
                  "Delete files with Storage sense\n1. Open the Start  menu and select Settings  > System > Storage. Open Storage settings.\n2. Turn on Storage sense to have Windows delete unneccesary files automatically.\n3. To delete unnecessary files manually, select Change how we free up space automatically. Under Free up space now, select Clean now.\n\nUninstall apps you don't use anymore\n1. Open the Start  menu and select Settings  > Apps > Apps & features. Open Apps & features settings.\n2. Search for a specific app or sort them by size to see which ones are taking up the most space.\n3. When you find an app you want to delete, select it from the list, and then select Uninstall.\n\nMove files to another drive\n1. Connect your removable media to your device.\n2. Open File Explorer from the taskbar and find the files you want to move.\n3. Select the files, go to the Home tab, and then select Move to > Choose location.\n4. Select your removable media from the location list, and then select Move.\n"
            ]
      },
      {
            "tag": 311,
            "patterns": [
                  "The wheel on my mouse isn't working properly",
                  "Mouse wheel not scrolling"
            ],
            "responses": [
                  "1. Reconnect the mouse. Before doing anything, make sure the issue isn't a temporary one. You can do this by disconnecting the mouse from the USB port and plugging it back in. Whenever you plug in a mouse, it restarts the mouse drivers and this alone could resolve the issue. You might even try using a different USB port. If you're using a wireless mouse, make sure you've connected it properly to your PC.\n2. Replace the batteries. If you're using a wireless mouse, low battery power is the most common cause of strange mouse behavior. Whether the mouse wheel isn't scrolling or the mouse is otherwise acting erratically, swapping the batteries is a very quick and inexpensive way to rule out this cause.\n3. You might also consider switching to rechargeable batteries so that you can always have fully charged batteries on hand that you swap out on a schedule. This way you don't have to wait until your mouse starts acting up before changing them.\n4. Clean the mouse. Most modern mice don't have rollers to clean anymore, but now the scroll wheel is the one mechanical part. This also means it's the part prone to attracting dirt, dust, and food particles. These slip in through the cracks on the side of the wheel and can lead to the mouse scroll wheel not working. If your mouse is wireless, there are some special wireless mouse cleaning considerations to keep in mind.\n5. Check the touchpad. Another common issue is mouse interference from something touching the touchpad on your laptop. This could be something as simple as water leaking from a cup nearby. You might even consider temporarily disabling your touchpad just to see if this fixes the problem.\n6. Check mouse wheel settings. Each OS has unique settings to control the mouse wheel. If these change you could experience the mouse wheel not scrolling. Look through your mouse settings on your Windows 10 to ensure wheel scrolling is actually enabled and configured properly.\n7. Update mouse drivers. The most effective way to update your mouse driver is to download and install the latest mouse driver from the manufacturer's website. On a Windows 10 PC, check the Device Manager to ensure there isn't an exclamation mark next to the mouse driver after you've updated. If there is, you'll want to roll back the mouse driver and try something else.\nNote: Before moving on to the final step, try using a different mouse to make sure that the issue is actually with your system and not a mouse hardware failure. You wouldn't want to take more drastic measures with your computer if all you need is to buy a new mouse.\n8. Fix corrupt system files. At this point, it is possible your system files may be corrupt. Before you try anything drastic, make sure you've installed the latest system updates for Windows 10. Next, try to perform an automatic repair for Windows 10. If all else fails, you may need to do a full Windows 10 system restore or a clean install of Windows if you don't have a recovery backup."
            ]
      },
      {
            "tag": 312,
            "patterns": [
                  "Laptop plugged in but not charging",
                  "Battery won't charge"
            ],
            "responses": [
                  "If your laptop refuses to charge the battery even though it acknowledges that it's plugged in, here's what you need to do:\n\n1. Open the Device Manager by searching for it or right-clicking the Start button and selecting Device Manager.\n2. Click Batteries on the list to expand it and you should see two items: Microsoft AC Adapter and Microsoft ACPI-Compliant Control Method Battery.\n3. Right-click on each item and choose Uninstall device. Yes, you are uninstalling your laptop's battery drivers, but don't worry because they will automatically be reinstalled when you restart your laptop.\n4. Shut down your laptop.\n5. Unplug the power cable from your laptop.\n6. If your laptop has a removable battery, remove it. My Lenovo laptop does not have a removable battery. I tried skipping this step but it didn't work, so I removed the bottom panel of my laptop and then removed the battery by disconnecting it from the motherboard.\n7. Put the battery back in if you removed it.\n8. Plug in your laptop.\n9. Power on your laptop.\n10. Click the battery icon in the system tray and you should see that your laptop is plugged in and charging."
            ]
      },
      {
            "tag": 313,
            "patterns": [
                  "My computer is too noisy",
                  "Laptoping making loud noise"
            ],
            "responses": [
                  "1. Make sure the sound comes from the hard drive\nUsually, when we hear the sound from our computers, it’s a hard drive sound. So when the sound suddenly gets louder, we assume that it’s from the hard drive.\nTo check this, you can simply unplug the power and data cables from the hard drive and reboot the system. If you still hear the sound, the issue is not with the hard drive.\n\n2. Run a diagnostic software\nIf you’re certain that the sound comes from the hard drive itself, you can run a free hardware diagnostic software which is already available on many computers or available on the internet.\n\n3. Replace the hard drive\nIf the diagnostic software fails, it simply means there is an issue related to the hardware of the drive. If in that case, there is nothing you can do except to replace it.\nRemember to make a back up of your files before replacing it."
            ]
      },
      {
            "tag": 314,
            "patterns": [
                  "My disc drive won't open",
                  "How to fix a CD reader not ejecting?"
            ],
            "responses": [
                  "We'll start with the easiest way to get the drive open—skip the physical button on the outside and ask your operating system to force eject the disc. You can only try this if your computer has power and is working. Skip down to the next section if that's not the case.\n1. Open File Explorer. Search for it or use the WIN+X menu to open it quickly.\n2. Once open, navigate to the optical drive from the menu on the left. This drive is often auto-named based on what disc is inside the drive but there's usually a small disc icon to help identify it.\n3. Right-click or tap-and-hold the optical drive and choose Eject from the menu that pops open.\n4. File Explorer in Windows 10 showing right-click menu with Eject command highlighted\n7. The drive bay or disc should spin down and eject within seconds."
            ]
      },
      {
            "tag": 315,
            "patterns": [
                  "How to connect to Internet via wire on LAN port?",
                  "Connect to internet using Ethernet cable"
            ],
            "responses": [
                  "1. Connect a LAN cable to the PC's wired LAN port. If there is no LAN port on the side of the laptop computer, use a LAN adapter to connect.\n2. Click the Start button on the taskbar and then click Settings.\n3. Click Network and Internet.\n4. In Status, click Network and Sharing Center.\n5. Choose Change adapter settings at the upper left.\n6. Right-click Ethernet and then choose Properties.\n7. Select Internet Protocol Version 4 (TCP/IPv4), then click Properties\n8. Set up the IP to use, then click OK to save your settings.\n"
            ]
      },
      {
            "tag": 316,
            "patterns": [
                  "How to extend my screen?",
                  "How to use a second monitor?"
            ],
            "responses": [
                  "To get your PC to recognize multiple monitors:\nMake sure your cables are connected properly to the new monitors, then press Windows logo key  + P to select a display option.\nIf you need more help, here's what to do: \n\n1. Select Start > Settings > System > Display. Your PC should automatically detect your monitors and show your desktop. If you don't see the monitors, select Detect.\n2. In the Multiple displays section, select an option from the list to determine how your desktop will display across your screens.\n3. Once you've selected what you see on your displays, select Keep changes.\n\nYou can change the resolution of your displays. However, we suggest using the recommended resolution to get the most out of your displays."
            ]
      },
      {
            "tag": 317,
            "patterns": [
                  "How to rotate my screen?",
                  "How do I flip my computer screen?"
            ],
            "responses": [
                  "1. Click the magnifying glass icon in the bottom-left corner of your screen.\n2. Then type “rotate screen” in the search bar and click Open.\n3. Click the Display Orientation drop-down box and choose an option. You will see this option under Scale and layout.\n4. Press Esc on your keyboard if you want to go back to the screen orientation you had before."
            ]
      },
      {
            "tag": 318,
            "patterns": [
                  "How to disable touchpad?",
                  "How to enable touchpad?"
            ],
            "responses": [
                  "Press the Windows key, type touchpad, and press Enter. Or, press Windows key+I to open Settings and choose Devices, then Touchpad.\nIn the Touchpad Settings window, click the Touchpad toggle switch to the On/Off position."
            ]
      },
      {
            "tag": 319,
            "patterns": [
                  "How to clean my keyboard?"
            ],
            "responses": [
                  "Tap Crumbs Loose, but Don’t Shake Your Laptop\nYou can remove some crumbs and other debris by gently turning your laptop over and lightly tapping it. Don’t shake it or you could damage some of your computer’s hardware. Solid-state laptops and stand-alone keyboards are more durable, but that’s no green light for an earthquake-level shake down. For a less-risky crumb removal (or after the initial shake), try using the sticky end of a Post-it note on the hard-to-remove specks or a piece of adhesive tape.\n\nGet Some Air\nCanned air or dust removal spray — available at office supply stores, general retail stores and even auto parts dealers – is your top quick-cleaning agent. Used with a micro-straw-like dispenser, you’ll be able to easily (and carefully!) blow debris and dust out from between your keys for removal. Remember to keep the canister at less than a 40-degree angle, pointed down toward the keyboard, or you’ll end up discharging refrigerant.\n\nTry a Dust Vac to Clean Keyboard\nAfter you’ve blown the dust and debris to one spot — or if you don’t happen to have any canned air — use a hand vac with a narrow dust attachment to suck up the undesirables. If you’re using a stand-alone keyboard, make sure none of your keys are loose, or you could be hunting for a lost letter inside your dust vac’s filter. For better results, buy a USB vacuum cleaner that plugs directly into a USB port and comes with a thin keyboard cleaning attachment.\n\nFor Caked-On Grime, Use Screen Wipes\nApply gentle pressure to wrest globs of gunk from your keys. Don’t overdo it, or you risk actually peeling the characters off the keys (unless you’re using an older keyboard with burnished characters). You can also use a topical cleaner, but spray it onto a soft cloth or paper towel and then clean your keys. Do not spray the cleaner directly onto the keyboard.\n\nUse Cotton Swabs between the Keys\nThese can be dry or lightly moistened with a gentle cleaner. Wipe carefully and slowly between the keys, and across the tops and bottoms, to remove excess dust.\n\nYou’ll want to run through this cleaning ritual every 1 to 3 months. If you use more than one keyboard regularly, remember to clean all of them. And of course, always check your owner’s manual for model-specific keyboard cleaning instructions.\n\nA Few Cleaning Don’ts\n- Don’t try to remove keys from the keyboard to wash them by hand — especially if you’re using a laptop. Some machines have keys that are designed to be removed for cleaning, but most do not.\n- Don’t put your stand-alone keyboard in the dishwasher. Some technicians swear by this method, and your keyboard might live to type another day. Odds are, however, you’ll kill it and have to buy another one. (And if that’s the case, why clean it anyway?)\n- Don’t put your laptop in the dishwasher or washing machine in an attempt to clean the keys — unless you really want to lose your data and have to buy another machine.\n- Don’t try to dry off a wet keyboard in the clothes dryer, or in the oven — unless you’re bored with the keyboard’s desk-friendly, flat shape.\n- Don’t try to clean the keyboard using steel wool, cleaning sponges or spray-on lime and calcium removers — unless you plan to test your memory once all the letters come off the keys.\n- Don’t forget to turn your computer off before attempting to clean a keyboard. Today’s machines are just as prone to pressure- and moisture-induced mechanical errors as their 5- or even 10-year-old ancestors were."
            ]
      },
      {
            "tag": 320,
            "patterns": [
                  "How to safely eject a hard drive"
            ],
            "responses": [
                  "First close any applications currently using your external storage device including any open windows that displays its contents, then locate the \"Safely Remove Hardware\" icon located next to the system clock on the taskbar by the system tray. You may have to expand it by clicking on the arrow. Click on the \"Safely Remove Hardware\" icon to launch the hardware pop-up window, then click your external hard drive's icon or assigned disk letter. Alternatively, if you do not see or are not able to locate the \"Safely Remove Hardware\" icon in the system tray, navigate to the Computer or My Computer from the desktop or Start Menu. When the Computer or My Computer window opens, locate your external storage device. Left-click once to highlight it  then right-click. On the resulting pop-up window, click on Eject. Lastly, Wait for the \"Safe to Remove Hardware\" message to come up and then remove your external storage device."
            ]
      },
      {
            "tag": 321,
            "patterns": [
                  "How do I connect a local printer to my computer"
            ],
            "responses": [
                  "1. Connect the printer to your computer using the USB cable and turn it on. 2. Open the Settings app from the Start menu. 3. Click Devices. 4. Click Add a printer or scanner. 5. If Windows detects your printer, click on the name of the printer and follow the on-screen instructions to finish the installation. And you're done. If Windows doesn't find your connected printer, click on \"The printer that I want isn't listed\" link. Then let the Windows troubleshooting guide help you find your printer. It will search for available printers and help you download the drivers for them. If that doesn't work, head to your printer manufacturer's website and download the drivers and installation tools for your printer."
            ]
      },
      {
            "tag": 322,
            "patterns": [
                  "How to do screen mirroring "
            ],
            "responses": [
                  "1. Select Start  > Settings  > System  > Projecting to this PC .\n2. Under Add the “Wireless Display” optional feature to project this PC, select Optional features. \n3. Select Add a feature, then enter “wireless display.” \n4. Select it from the list of results, then select Install. \n5. After “Wireless Display” is installed, manage your projecting preferences on the Projecting to this PC page in Settings. 6. On the PC you’re projecting to, launch the Connect app by entering “Connect app” in the search box on the taskbar. 7. On the device you’re projecting from, go to the screen mirroring settings (sometimes called cast settings), and select your PC to connect to it. If you’re projecting from a PC, you can also select Windows key (  )+ K and select the PC you’d like to connect to."
            ]
      },
      {
            "tag": 323,
            "patterns": [
                  "How to download photos from my phone on to my computer"
            ],
            "responses": [
                  "1. Turn your phone on and unlock it. Your PC can’t find the device if the device is locked.\n2. On your PC, select the Start  button and then select Photos to open the Photos app.\n3. Select Import > From a USB device, then follow the instructions. You can pick the items you want to import and select where to save them. Allow a few moments for detection and transfer."
            ]
      },
      {
            "tag": 324,
            "patterns": [
                  "How to set up multiple displays on my computer"
            ],
            "responses": [
                  "1. Select Start > Settings > System > Display. Your PC should automatically detect your monitors and show your desktop. If you don't see the monitors, select Detect.\n2. In the Multiple displays section, select an option from the list to determine how your desktop will display across your screens.\n3. Once you've selected what you see on your displays, select Keep changes."
            ]
      },
      {
            "tag": 325,
            "patterns": [
                  "How to set up windows 10"
            ],
            "responses": [
                  "1. Press the power button to turn on the computer. During the setup process, Windows 10 might take a long time to process an item without visual feedback on the screen to indicate progress. This is normal.\n   CAUTION: To avoid damaging the data on the computer, do not restart your computer during the setup process.\n2. Let's start with region. Is this correct? screen displays. Select your country or region from the list, and then click Yes.\n3.The Is this the right keyboard layout? screen displays. Select the desired keyboard layout, and then click Yes. 4. On the Do you want to add a second keyboard layout? screen, you can either follow the instructions for adding another keyboard layout or click Skip.\n5. On the Let's connect you to a network screen, select from the available networks, type in your user name and password if necessary, and then click Connect. 6. After a few introductory setup screens that require no action, the Windows 10 License Agreement screen displays. After reading the license agreement, to proceed, click Accept to continue. 7. After the license agreement, the Sign in with Microsoft screen displays. Sign in with your Microsoft account or click Create account and follow the prompts to create a new Microsoft account. 8. After signing in the following setup screens display. Follow the on-screen instructions to customize Windows.\nLink your Android or iPhone to this PC\nProtect your files with OneDrive\nSet up your Office\nMake Cortana your personal assistant?\nDo more across devices with activity history\nChoose privacy settings for your device\n9. On the registration screen, type your personal information, and then click Next. 10. On the Register and Protect screen, select your preferred privacy settings, and then click Next. 11. Read any introductory screens describing the features of your computer, make selections when prompted, and then click Next up on completing each.\nYou are now done with the initial setup process."
            ]
      },
      {
            "tag": 326,
            "patterns": [
                  "How to set up a Macbook"
            ],
            "responses": [
                  ""
            ]
      },
      {
            "tag": 327,
            "patterns": [
                  "How do I check how much memory my computer has"
            ],
            "responses": [
                  "Open settings > system > about >  look for the Device Specifications section. You should see a line named \"Installed RAM\"—this will tell you how much you currently have."
            ]
      },
      {
            "tag": 328,
            "patterns": [
                  "How do I change mouse speed/DPI"
            ],
            "responses": [
                  "1. Click on the \"Start\" menu and select the \"Settings\" icon. 2. On the Settings page, click on \"Devices.\" 3. On the Devices page, click on \"Mouse.\" 4. On the Mouse page, click on \"Additional mouse options\" under \"Related settings.\" 5. In the \"Mouse Properties\" pop-up, click on \"Pointer Options.\" 6. Use the slider under \"Select a pointer speed\" to adjust DPI. Sliding it to the left lowers DPI while sliding it to the right increases DPI. 7. When the slider is where you want it, click \"Apply\" at the bottom. When the \"Apply\" button turns gray, meaning there are no additional changes to confirm, click on the \"X\" in the top right corner to close it."
            ]
      },
      {
            "tag": 329,
            "patterns": [
                  "How do I clean my keybaord"
            ],
            "responses": [
                  "1. Take a photo of your entire keyboard. We're about to take off all the keys, so you'll want this photo as a reference for reassembly. 2. Gently pry up the keycaps using a small flat-head screwdriver. 3. Blow away dirt using compressed air, or suck up the dirt using a small vacuum. Be careful as to not damage any exposed mechanics or electronics. 4. Wipe the keyboard base using isopropyl alcohol and a cotton swab or lint-free cloth. 5. Scrub each removed keycap with a toothbrush and isopropyl alcohol. 6. Replace the keycaps when you're satisfied with the keyboard's cleanliness. Reference that photo you took earlier so that you can get each key back where it belongs. 7."
            ]
      },
      {
            "tag": 330,
            "patterns": [
                  "How do I clean my monitor"
            ],
            "responses": [
                  "1. Turn off the monitor and the computer, and then disconnect the power cables. Make sure the monitor has cooled down before going to the next step.\n2. Using a clean microfiber cloth, gently wipe the monitor’s screen to remove dust and fingerprints. Do not press on the screen while cleaning. You can also use compressed air to remove dust from the screen.\n3. Dampen the cloth with a small amount of distilled water. If there is a touch stain (such as food) on the monitor, you can also try using a mixture of 50 percent distilled water and 50 percent white vinegar. Make sure you wring out any excess liquid from the cloth before using it.\n4. Gently wipe the monitor with the dampened microfiber cloth. Do not press on the screen while cleaning.\n5. When you are finished, allow the monitor to dry and then reconnect the power cables."
            ]
      },
      {
            "tag": 331,
            "patterns": [
                  "How do I free up space on my hard drive"
            ],
            "responses": [
                  "1. Choose Start→Control Panel→System and Security and then click Free Up Disk Space in the Administrative Tools. 2. Choose the drive you want to clean up from the drop-down list and click OK. 3. Select additional files in the list to delete by clicking next to them. 4.  Click OK. 5. Click the Close button."
            ]
      },
      {
            "tag": 332,
            "patterns": [
                  "How do I update my Bios"
            ],
            "responses": [
                  "1. Open Start Image titled Windowsstart.png. Click the Windows logo in the bottom-left corner of the screen.\n2. Open System Information. Type msinfo into the Start window, then click System Information at the top of the Start window.\n3. Check your computer's model name. Next to the \"System Model\" heading, you'll see a list of numbers and letters; this is your computer's model name. You'll need this information when you search for the BIOS update file.\n-Skip this step if you have a custom-built computer. \n4. Find your BIOS version number. Next to the \"BIOS Version/Date\" heading, you'll see a company name, your computer's model name, and a number after a period. The number after the period is your BIOS version.\nFor a computer with the model number \"Q553UB\" and a BIOS set to version 202, for example, you would see \"Q553UB.202\" here.\nIf you're using a custom-built computer, you'll need to find your motherboard's model instead of using the computer's model number. \n5. Open your BIOS manufacturer's support site. Generally, the easiest way to do this is by typing your computer's manufacturer name, your computer's model name, and \"drivers\" or \"BIOS\" into Google and then selecting the proper link. This process will vary depending on your computer's manufacturer, so you may have to click through a few different links before you find the correct one.\nIf you're using a custom-built computer, you'll need to look up your computer's motherboard name along with \"BIOS\" and \"update\" and then open the manufacturer's website. \n6. Find the BIOS update file. Depending on the website, you may have to open the \"Updates\", \"Support\", or \"Downloads\" section first, or click a \"BIOS\" heading. Once you've found the BIOS file, you can proceed.\nAgain, this may involve some trial and error. \n7. Make sure the update file is newer than your BIOS version. In the file's name, you should see a version number. If this version number is higher than your BIOS version number, your BIOS is outdated and thus can be updated.\nIf the version number on the website matches your BIOS version number, your BIOS is up-to-date and does not need updating.\nEven if your current BIOS version is a whole number (e.g., 301) and the file on the site is listed as a higher decimal (e.g., 301.1), the site's file is a higher version than your BIOS uses. \n8. Download the update file. Click the Download link, button, or icon to do so. Once your BIOS update file finishes downloading, you can proceed with updating your BIOS.\nIn some cases, you may have to click the file's name to prompt it to download.\nMost BIOS update files will download inside of a ZIP folder. \n9. Make sure your computer is plugged into a reliable power source. Since you can permanently ruin your BIOS if your computer turns itself off during the update process, you'll want to use a reliable power source.\nIf you're using a laptop, your computer's battery should be fully charged in addition to the laptop being plugged in. \n10. Extract your BIOS file. In most cases, you'll have to extract (or \"unzip\") the BIOS update file from within its folder:\nDouble-click the downloaded ZIP file to open it.\nClick the Extract tab at the top of the window.\nClick Extract all.\nClick Extract when prompted.\nWait for the extracted folder to open. \n11. Read your BIOS file's README document if applicable. If a text document labeled \"README\" or similar is available, double-click it to open it and read the entire document before proceeding.\nIf the README file's instructions for updating your BIOS contradict the instructions in the rest of this article, make sure you follow the README's instructions instead. \n12. Plug a USB flash drive into your computer. Since your BIOS won't be able to access your computer's files, you'll need to put the BIOS update file on a blank USB flash drive \n13. Copy the BIOS file onto the flash drive. Click once the BIOS file, press Ctrl+C to copy it, then open your flash drive and press Ctrl+V to paste in your copied file.\nYou need to leave the flash drive plugged into your computer for the duration of the update process. \n6. Access the BIOS page. Prompt your computer to restart by clicking Start Image titled Windowsstart.png, clicking Power Image titled Windowspower.png, and clicking Restart, then immediately begin pressing the key your computer's manufacturer assigned to the BIOS startup. If the BIOS doesn't launch, you'll need to restart again and try a different key.\nFor most computers, this key is one of the function keys (e.g., F12), though some computers use the Del key or the Esc key.\nIf you don't know your computer's BIOS key, look it up by typing your computer's manufacturer name, model name, and \"BIOS key\" into a search engine. \n14. Back up your BIOS if possible. If you see a \"Backup\" or \"Save\" option on the BIOS' main screen (or if you see a Backup tab at the top of the screen), select it and follow any on-screen instructions. This will ensure that you can restore your BIOS settings later if your BIOS update doesn't pair well with your computer.\nYou may instead be prompted to back up your BIOS once you initiate the backup process.\nNot all BIOS pages allow you to back up their settings. \n15. Enable and use your BIOS update tool. Each BIOS will have a slightly different way of accessing the BIOS update tool, so you may have to consult your BIOS manufacturer's support site for a direct explanation of how to do so.\nIn many cases, you'll select the Boot tab, ensure that your USB flash drive shows up, enable any backup or \"Flash\" options in the menu, and then select the Start Flash option from the Advanced tab.[1]\nSometimes, pressing the BIOS key while a USB drive is plugged in will bring up a unique menu that allows you to select an Update option and follow the on-screen instructions. This is common on Dell computers.[2] \n16. Allow your computer's BIOS to update. This process can take a few minutes to over an hour depending on your computer and the depth of the BIOS update. Once your BIOS is finished updating, your computer should restart itself, though you may be prompted to confirm this decision.\nDo not turn off your computer while the BIOS is updating. Doing so can cause the BIOS to become corrupted, meaning that your computer will be unable to start, complete the BIOS installation, or otherwise run at all."
            ]
      },
      {
            "tag": 333,
            "patterns": [
                  "Should I leave my computer on or turn it off"
            ],
            "responses": [
                  "Reasons to leave it on : You’re using the PC as a server, or you want to access it remotely.\nThere are background updates, virus scans, or other activities you’d like to occur while you’re away.\nYou never want to wait for it to start up. Reasons to turn it off: Leaving it on wastes electricity and can slightly increase your power bill.\nYou don’t want to be disturbed by notifications or fan noise.\nComputer performance generally benefits from an occasional reboot."
            ]
      },
      {
            "tag": 334,
            "patterns": [
                  "How do I reformat a hard disk"
            ],
            "responses": [
                  "1. Plug in the drive and open Windows Explorer.\n2. Right-click the drive and choose Format from the drop-down menu.\n3. Select the file system you want, give your drive a name under Volume label, and make sure the Quick Format box is checked.\n4. Click Start, and the computer will reformat your drive.\nWhen you’ve completed the process, you can open the external drive in Windows Explorer."
            ]
      },
      {
            "tag": 335,
            "patterns": [
                  "How do I add more ram to my computer"
            ],
            "responses": [
                  "Step 1 - Gathering Supplies\nClear off your installation space and make sure you’re working in a static-safe environment. Remove any plastic bags or papers from your workspace. Then, you’ll need the following items:\nYour desktop computer\ndesktop memory\nScrewdriver\nOwner’s manual.  Step 2 - Shut Down Your Desktop Computer. Step 3 - Unplug the Power Cable\nThis includes any cables and accessories plugged into the computer. Step 4 - Hold the Power Button for Five Seconds. Step 5 - Open the Case\nFor instructions about opening your specific system, consult its owner’s manual. You can also take pictures as you work through the process to see where cables or screws are attached to make it easier to put back together. Step 6 - Ground Yourself!\nTouch an unpainted metal surface – this is an extra safeguard that protects your computer memory and components from static damage during the installation process.  Step 7 - Remove Existing Memory Modules\nPress down on the clips on the sides of each module, the clip mechanism will push the memory module up. You can then pull the module completely out.  Step 8 - Install Memory\nHolding the modules along the edges, align the notches on the module with the ridge in the slot, then apply even pressure and firmly press the module in. It usually takes about 30 pounds of pressure to fully install the module. Step 9 - Close the Computer Case\nStep 10 - Plug the Power Cable in\nYour Memory is now Installed!"
            ]
      },
      {
            "tag": 336,
            "patterns": [
                  "How do I know if my battery is damaged"
            ],
            "responses": [
                  "1. Right-click on the Start icon and select Windows PowerShell (Admin) from the menu that appears. A pop-up window may ask for permission to make changes to your device; say yes. 2. The blue PowerShell command window will appear, allowing you to enter commands to automate certain tasks within Windows 10. Type or paste powercfg /batteryreport /output \"C:\\battery-report.html\" into the window and press Enter to run the command. 3. PowerShell will then tell you the name of the generated battery life report HTML file and where it has been saved on your computer. In this case, it is called battery-report.html and it has been saved to the C drive. You can now safely close PowerShell. 4. Open Windows File Explorer and access the C drive. There you should find the battery life report saved as an HTML file. Double-click the file to open it in your preferred web browser. 5. The report will outline the health of your laptop battery, how well it has been doing, and how much longer it might last. At the top of the Battery Report, you will see basic information about your computer, followed by the battery's specs."
            ]
      },
      {
            "tag": 337,
            "patterns": [
                  "My speakers are not working, what is wrong"
            ],
            "responses": [
                  "1.Open the Control Panel.\n2.Click or double-click the Hardware and Sound or Sound icon.\nI3.n Windows XP and older, click Manage audio devices under Sound.\n4.In the Sound window, on the Playback tab, find the entry for the speakers connected to your computer.\n5.Right-click the speaker's entry and select Set as Default Device.\n6.Click OK at the bottom of the Sound window to save the settings change. If you are running Microsoft Windows, make sure the speaker setup is correct by following the steps below.\n\n1.Open the Control Panel.\n2.Select Hardware and sound or Sound in the Control Panel window.\n3.In Windows XP and older, click Manage audio devices under Sound.\n4.On the Playback tab, select your speakers, and click the Configure button.\n5.If the speakers still don't work after configuring and testing them, double-click the speakers on the Playback tab to bring up Speaker Properties.\n6.Verify all settings and then Test on the Advanced tab.\n7.After verifying all settings and making any changes, click Apply then OK in each of the appropriate windows before closing them. Your speakers may not work for the following reasons: Volume issues, Speakers are not connected properly, Corrupt Windows system files, Integrated or onboard audio disabled, Bad sound card, Bad speakers"
            ]
      },
      {
            "tag": 338,
            "patterns": [
                  "How do I connect bluetooth speakers to my computer"
            ],
            "responses": [
                  "1. Turn on your Bluetooth audio device and make it discoverable. The way you make it discoverable depends on the device. Check the device or visit the manufacturer's website to learn how. \n\n2. On your PC, select Start > Settings  > Devices  > Bluetooth & other devices > Add Bluetooth or other device > Bluetooth. Choose the device and follow additional instructions if they appear, then select Done. \n\nYour Bluetooth device and PC will usually automatically connect anytime the two devices are in range of each other with Bluetooth turned on."
            ]
      },
      {
            "tag": 339,
            "patterns": [
                  "How do I download the latest update"
            ],
            "responses": [
                  "If you want to install the update now, select Start  > Settings  > Update & Security  > Windows Update , and then select Check for updates. If updates are available, install them."
            ]
      },
      {
            "tag": 340,
            "patterns": [
                  "How do I run a diagnostics test on my computer"
            ],
            "responses": [
                  "1. Type “Control Panel” on Windows search bar. Click on “Control panel”. 2. Search and Hit on “System and Security”. 3. Hit on “Administrative Tools”. 4. Click on “Windows Memory Diagnostic”.\nShort Trick: Press Windows Key + R and type mdsched.exe\n5. Select “Restart now and check problems” option.\n"
            ]
      },
      {
            "tag": 341,
            "patterns": [
                  "My monitor won't turn on, what do I do"
            ],
            "responses": [
                  "1.Check the Power LED on the Monitor if you are using an external monitor. 2. Unplug the monitor from the wall.\n3. Unplug the cord from the back of the monitor.\n4. Wait one minute\n5. Plug the monitor cord back into the Monitor and a known-good wall outlet.\n6. Press the Monitor power button.\n7. If this still does not work, try with known-good power cord. Typically a Desktop power cord is the same as a Monitor power cord \n8. Confirm that a power cable is connected to the monitor and a power outlet.\n9. Ensure the video cable is connected to the correct video source.."
            ]
      },
      {
            "tag": 342,
            "patterns": [
                  "My screen is frozen"
            ],
            "responses": [
                  "Hit CTRL + ALT + Delete, then click “End Task” to force-quit any or all applications."
            ]
      },
      {
            "tag": 343,
            "patterns": [
                  "My computer is slow"
            ],
            "responses": [
                  "1. Reboot your computer. 2. Delete background programs. 3. Delete temp files. 4. Free hard drive space. 5. Check the hard drive for errors run ScanDisk, chkdsk, or something equivalent to verify there is nothing physically wrong with the computer's hard drive. 6. Make sure hard drive is not fragmented\nRun Defrag to help ensure that data is arranged in the best possible order. 7. Scan for viruses 8. Scan for malware. 9. Update the operating system. 10. Disable browser plug-ins. 11. Update your drivers. 12. Reboot the computer again. 13. Run a registry cleaner. 14. Memory and hard drive upgrade. 15. Computer or processor is overheating. 16. Increase or upgrade the processor speed. 17. Erase computer and start over.\n"
            ]
      },
      {
            "tag": 344,
            "patterns": [
                  "My computer is overheating"
            ],
            "responses": [
                  "1. Check if the fan is working or not. 2. Avoid blocking the vents. 3. Clean up the PC; turn off the PC, open the cover and you should be able to see visible dust., Blow the main PC components with air, use cotton buds to clean up the narrow spaces. 4. Stop overclocking (if this applies to you) 5. Speed up fan speed"
            ]
      }
]
}
